[
    {
        "summary": "Westheimer died Friday at her home in New York City, surrounded by her family, according to publicist and friend Pierre Lehu.",
        "image": "https://www.ocregister.com/wp-content/uploads/2024/07/Obit_Dr_Ruth_Westheimer_65417_d2a6b6-2.jpg?w=1024",
        "sentiment": 0.041,
        "author": "Associated Press",
        "language": "en",
        "video": null,
        "title": "Dr. Ruth Westheimer, America’s diminutive and pioneering sex therapist, dies at 96",
        "url": "https://www.ocregister.com/2024/07/13/dr-ruth-westheimer-americas-diminutive-and-pioneering-sex-therapist-dies-at-96-3-2/",
        "source_country": "US",
        "id": 251591334,
        "text": "By MARK KENNEDY | Associated Press Dr. Ruth Westheimer, the diminutive sex therapist who became a pop icon, media star and bestselling author through her frank talk about once-taboo bedroom topics, has died. She was 96. Westheimer died Friday at her home in New York City, surrounded by her family, according to publicist and friend Pierre Lehu. [] Westheimer never advocated risky sexual behavior. Instead, she encouraged open dialogue on previously closeted issues that affected her audience of millions. Her one recurring theme was there was nothing to be ashamed of. “I still hold old-fashioned values, and I’m a bit of a square,” she told students at Michigan City High School in 2002. “Sex is a private art and a private matter. But still, it is a subject we must talk about.” Also see: 4 female celebrities in their 90s offer tips for living a long and fulfilling life Westheimer’s giggly, German-accented voice, coupled with her 4-foot-7 frame, made her an unlikely looking — and sounding — outlet for “sexual literacy.” The contradiction was one of the keys to her success. But it was her extensive knowledge and training, coupled with her humorous, nonjudgmental manner, that catapulted her local radio program, “Sexually Speaking,” into the national spotlight in the early 1980s. She had an open approach to what two consenting adults did in the privacy of their home. “Tell him you’re not going to initiate,” she told a concerned caller in June 1982. “Tell him that Dr. Westheimer said that you’re not going to die if he doesn’t have sex for one week.” Her radio success opened new doors, and in 1983 she wrote the first of more than 40 books: “Dr. Ruth’s Guide to Good Sex,” demystifying sex with both rationality and humor. There was even a board game, Dr. Ruth’s Game of Good Sex. She soon became a regular on the late-night television talk-show circuit, bringing her personality to the national stage. Her rise coincided with the early days of the AIDS epidemic, when frank sexual talk became a necessity. “If we could bring about talking about sexual activity the way we talk about diet — the way we talk about food — without it having this kind of connotation that there’s something not right about it, then we would be a step further. But we have to do it with good taste,” she told Johnny Carson in 1982. She normalized the use of words like “penis” and “vagina” on radio and TV, aided by her Jewish grandmotherly accent, which The Wall Street Journal once said was “a cross between Henry Kissinger and Minnie Mouse.” People magazine included her in its list of “The Most Intriguing People of the Century.” She even made it into a Shania Twain song: “No, I don’t need proof to show me the truth/Not even Dr. Ruth is gonna tell me how I feel.” Westheimer defended abortion rights, suggested older people have sex after a good night’s sleep, and was an outspoken advocate of condom use. She believed in monogamy. In the 1980s, she stood up for gay men at the height of the AIDS epidemic and spoke out loudly for the LGBTQ+ community. She said she defended people deemed by some far-right Christians to be “subhuman” because of her own past. Born Karola Ruth Siegel in Frankfurt, Germany, in 1928, she was an only child. At 10, she was sent by her parents to Switzerland to escape Kristallnacht — the Nazis’ 1938 pogrom that served as a precursor to the Holocaust. She never saw her parents again; Westheimer believed they were killed in the gas chambers at Auschwitz. At age 16, she moved to Palestine and joined the Haganah, the underground movement for Israeli independence. She was trained as a sniper, although she said she never shot at anyone. Her legs were severely wounded when a bomb exploded in her dormitory, killing many of her friends. She said it was only through the work of a “superb” surgeon that she could walk and ski again. In 1961, after a second divorce, she finally met her life partner: Manfred Westheimer, a fellow refugee from Nazi Germany. The couple married and had a son, Joel. They remained wed for 36 years until Fred, as she called him, died of heart failure in 1997. In 1984, her radio program was nationally syndicated. A year later, she debuted in her own television program, “The Dr. Ruth Show,” which went on to win an Ace Award for excellence in cable television. Her rise was noteworthy for the culture of the time, when President Ronald Reagan’s administration was hostile to Planned Parenthood and aligned with conservative voices. Phyllis Schlafly, a staunch antifeminist, wrote in a 1999 piece called “The Dangers of Sex Education” that Westheimer, as well as Gloria Steinem, Anita Hill, Madonna, Ellen DeGeneres and others, were promoting “provocative sex chatter” and “rampant immorality.” Westheimer’s books include “Sex for Dummies” and her autobiographical works “All in a Lifetime” (1987) and “Musically Speaking: A Life Through Song” (2003). The documentary “Ask Dr. Ruth” aired in 2019, and a new book, “The Joy of Connections,” is due in October. Survivors include two children, Joel and Miriam, and four grandchildren.",
        "publish_date": "2024-07-13 17:31:54",
        "authors": [
            "Associated Press"
        ]
    },
    {
        "summary": "Metaphyuni's Genesis Cube mini PC is powered by a top AMD processor and can deliver up to 80W TDP.",
        "image": "https://cdn.mos.cms.futurecdn.net/UtAzATRbAzqNz8jxg64urR.png",
        "sentiment": 0.215,
        "author": "Wayne Williams",
        "language": "en",
        "video": null,
        "title": "Overclocked mini PC powered by AMD may well be the fastest in its category &mdash; Metaphyuni Genesis Cube supports up to 80W TDP, has two LAN ports, can drive four 4K displays and has an OCuLink connector",
        "url": "https://www.techradar.com/pro/overclocked-mini-pc-powered-by-amd-may-well-be-the-fastest-in-its-category-metaphyuni-genesis-cube-supports-up-to-80w-tdp-has-two-lan-ports-can-drive-four-4k-displays-and-has-an-oculink-connector",
        "source_country": "US",
        "id": 251597756,
        "text": "Although Metaphyuni isn’t a well-known brand outside of China, its latest high-performance mini PC, the Genesis Cube, should have you sitting up and paying attention. The Genesis Cube is available with either an AMD Ryzen 7 8845HS (Hawk Point) or 7840HS (Phoenix) processor, both with integrated Radeon 780M graphics. The two CPUs have similar clock speeds of 3.8 GHz - 5.1 GHz, but the 8845HS has a 45W TDP, compared to the 7840HS’s 35W TDP, making it better suited for more demanding applications. On top of that, the Genesis Cube offers Battle Mode, which will boost the 8845HS's TDP to 65W for gaming, or Performance Mode, which cranks the TDP up to 80W. Customizable RGB lighting The Genesis Cube supports 5600MHz DDR5 dual-channel memory and PCIe Gen4 and dual M.2 SSDs, providing decent storage flexibility. The Genesis Cube is compact and portable, measuring 150 x 150 x 49.5 mm and weighing just 730 grams. The front panel features a power button with fingerprint recognition, a USB 3.2 Gen 2 port, three USB 3.2 Gen 1 ports, and a 3.5mm audio jack. The back panel includes two USB4 ports, one supporting PD3.1 with 140W power delivery and DP1.4a, and the other supporting PD3.0 with 100W power delivery. There’s also an Oculink port so you can connect an external GPU, a USB 3.2 Gen 1 port, dual 2.5G Ethernet ports, DP2.0, and HDMI 2.1. The Genesis Cube is designed to handle demanding tasks while remaining compact and versatile. It supports up to four 4K displays, making it suitable for a range of professional applications. Customizable RGB lighting effects add to its appeal, so it’s not only powerful but also looks good. Pricing for the Genesis Cube starts at 2699 CNY (approx. $371) for the 7840HS barebone model and goes up to 3499 CNY ($481) with the addition of 16GB DDR5 and a 1TB PCIe 4.0 SSD. The 8845HS model will set you back 2899 CNY ($399) for the barebone, rising to 3699 CNY ($509) if you add the same RAM and storage. We don't know anything about availability outside of China at this point. More from TechRadar Pro These are the best mini PCs you can buyAnd these are the best mobile workstations available todayGeekom's mini PC makes it harder to justify buying a desktop PC",
        "publish_date": "2024-07-13 17:36:04",
        "authors": [
            "Wayne Williams"
        ]
    },
    {
        "summary": "The celebrations of Anant Ambani marrying Radhika Merchant took place at the Ambani-owned Jio World Convention Centre in Mumbai and the family home.",
        "image": "https://assets2.cbsnewsstatic.com/hub/i/r/2024/07/13/80bbee30-0526-4153-96b5-fe6115dee519/thumbnail/1200x630/3d6808566dd00ed15259f2c28cfdfe4e/gettyimages-2161760091.jpg?v=bc37a4cad39dacb7e4b48f11b71f691b",
        "sentiment": 0.487,
        "author": null,
        "language": "en",
        "video": "https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/2021/06/21/1911351875864/778205_hls/master.m3u8",
        "title": "Son of Asia's richest man gets married in the year's most extravagant wedding",
        "url": "https://www.cbsnews.com/news/marriage-billionaire-anant-ambani-radhika-merchant-mumbai-india/",
        "source_country": "US",
        "id": 251587718,
        "text": "The youngest son of Mukesh Ambani, Asia's richest man, married his longtime girlfriend early Saturday in what many dubbed the wedding of the year, attended by global celebrities, business tycoons and politicians, highlighting the billionaire's staggering wealth and rising clout.The wedding rituals, including exchanging garlands by the couple and walking around the sacred fire, began Friday and were completed past midnight.The celebrations of Anant Ambani marrying Radhika Merchant took place at the Ambani-owned Jio World Convention Centre in Mumbai and the family home. The marriage culminated months of wedding events that featured performances by pop stars including Rihanna and Justin Bieber.Prime Minister Narendra Modi attended a reception organized by the Ambanis on Saturday evening.The Ambanis hosted a \"blessing ceremony'' for friends and family members to meet the couple and wish them a happy married life.India Today television news channel reported that the newlyweds touched Modi's feet as a show of respect and sought his blessings.Four days of wedding celebrationsThe four-day wedding celebrations began Friday with the traditional Hindu wedding ceremony and will be followed by a grand reception to run through the weekend. The guest list includes former British Prime Ministers Tony Blair and Boris Johnson; John Kerry, the former U.S. special envoy for climate, Saudi Aramco CEO Amin H. Nasser; and Adele, Lana Del Rey, Drake and David Beckham, according to local media. The Ambani family did not confirm the guest list.Television news channels showed the arrivals of celebrities like Kim Kardashian, who was dressed in red, and professional wrestler and Hollywood actor John Cena.Kardashian sisters Kim and Khloé took a ride in a motorized rickshaw through bustling Mumbai streets Friday before joining the wedding ceremonies, the Press Trust of India news agency said.International guests wore traditional clothes by major Indian fashion designers. They put on embroidered sherwanis - long-sleeved outer coats worn by men in South Asia. Cena came in a sky-blue sherwani and white pants. Nick Jonas wore a pink sherwani and white pants.Bollywood icons Amitabh Bachchan, Shah Rukh Khan, Salman Khan and Ranbir Kapoor attended the wedding and danced to popular Hindi movie songs. Indian cricketers, including icons Sachin Tendulkar, Mahendra Singh Dhoni, Jasprit Bumrah, Hardik Pandya and Suryakumar Yadav, were among the invitees.Police imposed traffic diversions around the wedding venue from Friday to Monday to handle the influx of guests who flew to Mumbai, where heavy monsoon rains have caused flooding and flight disruptions for the past week.The extravaganza and the display of opulence that comes with the wedding have led many to raise questions about rising inequality in India, where the gap between rich and poor is growing. The event has also sparked anger among some Mumbai residents, who say they are struggling with snarled traffic.\"It affects our earnings. I don't care much about the wedding,\" said Vikram, a taxi driver who uses only one name.Asia's richest manThe father of the groom, Mukesh Ambani, is the world's ninth-richest man, with a net worth of $116 billion, according to Forbes. He is the richest person in Asia. His Reliance Industries is a conglomerate reporting over $100 billion in annual revenue, with interests that include petrochemicals, oil and gas, telecoms and retail.The Ambani family owns, among other assets, a 27-story family compound in Mumbai worth $1 billion. The building contains three helipads, a 160-car garage and a private movie theater.The groom, 29-year-old Anant, oversees the conglomerate's renewable and green energy expansion. He also runs a 3,000-acre (about 1,200-hectare) animal rescue center in Gujarat state's Jamnagar, the family's hometown.The bride, Radhika Merchant, also 29, is the daughter of pharmaceutical tycoon Viren Merchant and is the marketing director for his company, Encore Healthcare, according to Vogue.Ambani's critics say his company has relied on political connections during Congress Party-led governments in the 1970s and '80s, and under Prime Minister Narendra Modi's rule after 2014.The Ambani family's pre-wedding celebrations have been lavish and star-studded from the start.In March, they threw a three-day prenuptial bash for Anant that had 1,200 guests, including former world leaders, tech tycoons and Bollywood megastars, and performances by Rihanna, Akon and Diljit Dosanjh, a Punjabi singer who shot to international fame when he performed at Coachella. The event was also attended by tech billionaires Mark Zuckerberg and Bill Gates.It was the start of lavish, months-long pre-wedding celebrations that grabbed headlines and set off a social media frenzy.In May, the family took guests on a three-day cruise from Italy to France, which included Katy Perry singing her hit song \"Firework\" and a performance by Pitbull, according to media reports.The family also organized a mass wedding for more than 50 underprivileged couples on July 2 as part of the celebrations.Last week, Justin Bieber performed for hundreds of guests at a pre-wedding concert that included performances by Bollywood stars Alia Bhatt, Ranveer Singh and Salman Khan.Ambani also made headlines in 2018, when Beyoncé performed at pre-wedding festivities for his daughter. Former U.S. Secretaries of State Hillary Clinton and John Kerry were among those who rubbed shoulders with Indian celebrities and Bollywood stars in the western Indian city of Udaipur.",
        "publish_date": "2024-07-13 17:36:25",
        "authors": null
    },
    {
        "summary": "The Kansas City Chiefs tight end was even spotted bopping his head and singing along to a &#39;Lavender Haze&#39; remix",
        "image": "https://people.com/thmb/gYn-oYfnbbZeNRLC0NKmcjYkbmA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(727x528:729x530)/Taylor-Swift-Travis-Kelce-071324-410249f44312442aafbb43d123a4fe4d.jpg",
        "sentiment": 0.478,
        "author": "Kimberlee Speakman",
        "language": "en",
        "video": null,
        "title": "All the Taylor Swift Songs That Played While Travis Kelce Golfed at the Celebrity Charity Tournament in Nevada",
        "url": "https://people.com/taylor-swift-songs-played-while-travis-kelce-golfed-acc-tournament-8677666",
        "source_country": "US",
        "id": 251586446,
        "text": "Travis Kelce had a lengthy list of Taylor Swift songs to keep him upbeat at the 2024 American Century Championship this weekend. The Kansas City Chiefs tight end, 34, was treated to a plethora of his superstar girlfriend’s songs as he teed off at the three-day celebrity charity tournament at the Edgewood Tahoe Golf Course in Nevada alongside his brother Jason Kelce, 36. On Friday, July 12, Travis was captured on videos posted on X (formerly Twitter) by NBC Sports Bay Area & CA bopping and singing along to a remix of the 14-time Grammy winner’s song “Lavender Haze” from her 2022 Midnights album as he waited for his turn to drive alongside Jason. He was also captured moving his head and arm to the beat of the song as he walked up to take his shot at the 17th hole, before swinging the golf club as the song’s chorus continued to play in the background. \"Lavender Haze\" wasn’t the only Swift song on the tournament playlist. Swift's \"Fortnight” from her 2024 album, The Torture Poet’s Department, and “Love Story” from her 2008 Fearless album — which the couple danced to after his Super Bowl win in February — also blared through the speakers. This comes after Swift, 34, showed him some love on social media on Friday by liking a pair of ESPN posts on Instagram that declared her boyfriend the top tight end in the NFL based on surveys given to executives, coaches and scouts in the league. It appeared that Travis had a smooth second round in the golf tournament after a mishap during the first round, in which he accidentally hit a female fan with a golf ball in the back of her head. Paramedics swiftly attended to the woman, who an eyewitness said had visible streaks of blood in her blonde hair, and provided her with assistance while she sat on the ground. She was then spotted being helped up on her feet. Travis and Jason also checked in on the fan after the incident, with Travis making a lengthy walk down the course to see if she was OK and joked that after the hit, the least he could do was take a photo with her. Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer , from celebrity news to compelling human interest stories. Travis and Jason’s dad, Ed Kelce, as well as Jason’s wife, Kylie Kelce, cheered on the pair during the tournament on the sidelines. Several other sports stars — including Aaron Rodgers, Josh Allen, Derek Carr, Baker Mayfield, Trevor Lawrence, Joe Flacco and Kyle Juszczyk — also took part in the tournament, along with celebrities such as Don Cheadle, Michael Peña, Rob McElhenney and Miles Teller. The American Century Championship began will end Sunday, July 14.",
        "publish_date": "2024-07-13 17:38:47",
        "authors": [
            "Kimberlee Speakman"
        ]
    },
    {
        "summary": "<figure><img src=\"https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1688,w_3000,x_0,y_0/dpr_2.0/c_limit,w_585/fl_lossy,q_auto/240713-julie-lythcott-haimes-hero_rs6wgn\"/><figcaption>Photo Illustration by Erin O’Flynn/The Daily Beast/Public Domain</figcaption></figure><p>In a viral essay titled “I Had an Affair With My College Dean,” a female former Stanford University student revealed that she led an “affair” and “double life” with her college dean—who has been revealed to be Palo Alto politico and bestselling author, Julie Lythcott-Haims, 58.</p><p>Published July 10 <a href=\"https://www.autostraddle.com/i-had-an-affair-with-my-college-dean/\">on <em>Autostraddle</em></a>, 2011 Stanford grad Olivia Swanson Haas, who describes herself as a “bisexual writer,” wrote that she was 22-years-old when she became involved with Lythcott-Haims, who would have been about 42-years-old at that time. Haas said the experience was “a lot” for her to deal with at that age.</p><p>“Especially in this particu",
        "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1688,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1720883003/240713-julie-lythcott-haimes-hero_rs6wgn",
        "sentiment": 0.0,
        "author": "Emell Derra Adolphus",
        "language": "en",
        "video": null,
        "title": "Ex-Stanford University Dean Julie Lythcott-Haims Admits to Affair With Student",
        "url": "https://www.thedailybeast.com/ex-stanford-university-dean-julie-lythcott-haims-admits-to-affair-with-student",
        "source_country": "US",
        "id": 251596906,
        "text": "In a viral essay titled “I Had an Affair With My College Dean,” a female former Stanford University student revealed that she led an “affair” and “double life” with her college dean—who has been revealed to be Palo Alto politico and bestselling author, Julie Lythcott-Haims, 58. Published July 10 on Autostraddle, 2011 Stanford grad Olivia Swanson Haas, who describes herself as a “bisexual writer,” wrote that she was 22-years-old when she became involved with Lythcott-Haims, who would have been about 42-years-old at that time. Haas said the experience was “a lot” for her to deal with at that age. “Especially in this particular collegiate environment,\" Haas wrote in her essay. “Going through the pomp and circumstance of senior year, meanwhile secretly sleeping with one of the most public figures on campus.” Haas did not name Lythcott-Haims directly in the essay, but the description of her former dean's academic background and status as a “school celebrity” reportedly led many readers to connect the dots. Contacted for comment by Palo Alto Online, Lythcott-Haims confirmed in a statement to the outlet that she is the dean mentioned in the essay and called the affair “inappropriate.” “We’d been writing and recording music together and got to a point where we expressed love for each other,” claimed Lythcott-Haims, who was married to the father of her two children during the affair. “That is where it should have ended.” However, Haas recounts their relationship as more of a teachable moment for her life. “We told ourselves she was teaching me how to love myself, how to act on my desires,” she wrote. Lythcott-Haims said she was not in a position of authority over Haas’ grades or academic status at the university, and the affair continued until Haas’ parents quietly informed Stanford’s higher ups about the situation and Lythcott-Haims resigned. “Yes, she should have known better,” wrote Haas. “And yet, I had agency. She showed poor judgment. And I made poor choices. She misused her power. She made me feel beautiful.” Lythcott-Haims said she privately apologized to Haas years ago and encouraged her to share the story of their relationship whenever she was ready. “Now I want to publicly apologize to her for my actions and their impact on her,” said Lythcott-Haims. “I also apologize to my former colleagues and students who had the right to expect better of me. And to members of my extended family for whom the public airing of this matter may be difficult.” Stanford University reportedly declined to comment about the circumstances surrounding Lythcott-Haims’ departure. In an email to Palo Alto Online, the university’s director of media relations said the university’s policy “prohibits consensual relationships between undergraduates and faculty or certain staff roles, including deans, coaches, advisers and others.”",
        "publish_date": "2024-07-13 17:41:14",
        "authors": [
            "Emell Derra Adolphus"
        ]
    },
    {
        "summary": "A well-traveled Baker Mayfield made his way to the Tampa Bay Buccaneers in 2023. And now he appears to have found a long-term home after a Pro Bowl campaign…",
        "image": "https://media.bleacherreport.com/image/upload/v1720888982/adqvu1cem2xkytxp6b44.jpg",
        "sentiment": 0.304,
        "author": "Paul Kasabian",
        "language": "en",
        "video": null,
        "title": "Baker Mayfield Felt Treated 'Like a Piece of Dirty Laundry' Before Bucs Contract",
        "url": "https://bleacherreport.com/articles/10128176-baker-mayfield-felt-treated-like-a-piece-of-dirty-laundry-before-bucs-contract",
        "source_country": "US",
        "id": 251593252,
        "text": "A well-traveled Baker Mayfield made his way to the Tampa Bay Buccaneers in 2023. And now he appears to have found a long-term home after a Pro Bowl campaign led to a three-year contract worth up to $115 million. On Thursday, Mayfield spoke about the doldrums of being unable to find a more permanent landing spot on the Mike Calta Show (h/t Bobby Kownack of NFL.com), equating it to being a \"piece of dirty laundry.\" \"You're having a lot more fun when you're not getting shipped off to different places like a piece of dirty laundry, I'll tell you that,\" Mayfield said Thursday on the Mike Calta Show. \"So, when I got embraced in Tampa, it made a world of difference. I've always played ball to enjoy it. I mean, it is a game. \"Yes, it is my job, but I love it so much. I've always worn my emotions on my sleeve and, so, let people embrace that, and that's why I'm so excited for having more years to come in Tampa for people to just get to know me a little bit better, truly realize that's not just a show on the field. \"That's who I am when it comes down to the football aspect. I love it. I'd do anything for our team and our locker room guys know that.\" Mayfield spent four up-and-down (and injury-riddled) seasons with the Cleveland Browns to begin his career. Cleveland then all but discarded him for Deshaun Watson, leaving him in position to find a new home. He ended up with the Carolina Panthers in 2022, but that union ended in December when he requested his release after losing his starting gig. Injuries also marred his time there. Mayfield got a chance to showcase his talents, though, when the Los Angeles Rams picked him up for the tail end of the 2022 season with starter Matthew Stafford out due to injury. In four games, Mayfield completed 63.6 percent of his passes for 850 yards, four touchdowns and two interceptions. Tampa Bay then picked him up on a one-year deal, and he then beat Kyle Trask in a battle for QB1. Mayfield took great advantage of his opportunity, leading the Bucs to the NFC South title and a Divisional Round appearance after throwing for a career-high 4,044 yards and 28 touchdowns. Now he appears to be the long-term solution in town as Tampa Bay looks for its fifth straight playoff appearance.",
        "publish_date": "2024-07-13 17:45:34",
        "authors": [
            "Paul Kasabian"
        ]
    },
    {
        "summary": "The reality star sisters are attending the extravagant wedding of billionaire heir Anant Ambani and Radhika Merchant",
        "image": "https://people.com/thmb/GOFYudU1dMNLKk90Ky6cfIukmiQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(719x233:721x235)/khloe-kim-kardashian-ambani-wedding-india-tout-071324-9b4f92e2235c445fa41a3856314778bc.jpg",
        "sentiment": 0.659,
        "author": "Marina Watts",
        "language": "en",
        "video": null,
        "title": "Khloé Kardashian Shares Behind-the-Scenes Glimpses from Billionaire Heir&#39;s Wedding with Sister Kim",
        "url": "https://people.com/khloe-kardashian-posts-behind-the-scenes-glimpse-from-billionaire-heir-wedding-8677663",
        "source_country": "US",
        "id": 251594618,
        "text": "Khloé Kardashian took her followers behind-the-scenes of the extravagant wedding of billionaire heir Anant Ambani and Radhika Merchant. In several Instagram Stories posted on Friday, July 12 — the day of the traditional Hindu wedding ceremony — the Good American co-founder posted videos of herself and her sister, Kim Kardashian, who could be seen with Chris Appleton and Ash K. Holm. Appleton, 41, called the Mumbai-based event \"the most lavish wedding ever\" in a post on his own Instagram Stories. Elsewhere on her Instagram Stories, Khloé posted her pink and silver ensemble she wore the following day. She also treated her followers to hundreds of gorgeous flowers arranged inside the wedding. The floral decor didn't stop there — as she highlighted arrangements of vibrant flowers on larger-than-life elephant displays in another room, which were covered in an array of flowers and gold accents. The Economic Times reported that following the July 12 wedding, there will be a Divine Blessings Ceremony (Shubh Ashirwad) on July 13, as well as a grand reception (Mangal Utsav) the next day. Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer, from celebrity news to compelling human interest stories. The reality star sisters arrived in Mumbai on Thursday, July 11, for the multi-day event. They were welcomed by the hotel staff with flowers and then took a rickshaw ride to see the city. They also chose bold looks for the traditional wedding ceremony on Friday evening. Kim, 43, wore a glittery red lehenga with Lorraine Schwartz Jewelry. Khloé, meanwhile, donned a gold and white lehenga. They both completed their ensembles with sparkling maang tikkas that sat along their hairline. Amid all the wedding excitement, Kim also told her Instagram followers that they were filming parts of the wedding for her family's reality series, The Kardashians, Teen Vogue reported. “Had to screen grab our video bc we're just so happy to be lucky enough to travel the world together,” she wrote. \"And duh were filming The Kardashians too so you guys can see Kim and Khloe Take India.\" For the Saturday events, Khloé donned a pink lehenga, while Kim opted for a beige lehenga. The sisters once more wore elaborate jewelry to complete their sparkly outfits. Among the other A-List guests at the wedding are John Cena, Nick Jonas and Priyanka Chopra Jonas, plus former British Prime Minister Tony Blair and his wife Cherie. Chopra Jonas, 41, celebrated Ambani, 29, and Merchant, 29, on Instagram with a sweet post featuring the newlyweds, along with shots of her and Jonas, 31. \"What a special night it was celebrating two of the kindest, most gracious people I know,\" she wrote. The couple's pre-wedding party earlier this year notably included a performance by Rihanna and a traditional Gujarati meal that fed 50,000 people. Justin Bieber also performed for the couple on July 5, days before the nuptials.",
        "publish_date": "2024-07-13 17:57:02",
        "authors": [
            "Marina Watts"
        ]
    },
    {
        "summary": "&#34;It was so special to celebrate this life-changing event with my closest friends and chosen family,&#34; the &#39;Real Housewives of New York City&#39; alum tells PEOPLE",
        "image": "https://people.com/thmb/ZG8okuBM0I6qeUWEGxLLGSY5iMk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/eboni-williams-baby-shower-071224-5-776a085422514fc58ba983cb5bf6b827.jpg",
        "sentiment": 0.509,
        "author": "Dave Quinn,Erin Clack",
        "language": "en",
        "video": null,
        "title": "Inside Pregnant Eboni K. Williams&#39; Intimate, &#39;Enchanted Garden&#39;-Themed Baby Shower (Exclusive)",
        "url": "https://people.com/pregnant-eboni-k-williams-baby-shower-exclusive-photos-8677390",
        "source_country": "US",
        "id": 251594620,
        "text": "Eboni K. Williams celebrated her baby-on-the-way at an \"intimate\" shower with a close circle of loved ones on June 29. The 40-year-old Real Housewives of New York City alum, who revealed her pregnancy exclusively to PEOPLE in June, worked with her friend Cristina Alesci to bring to life her vision of an “enchanted garden”-inspired party at the Times Square EDITION luxury hotel in N.Y.C. She tells PEOPLE she invited just 30 people, wanting \"something intimate so we could truly celebrate, pray and build community for my little girl.\" \"Keeping the guest list to 30 was tough, but really added to the close-knit experience I wanted,\" adds Williams, who wore a long, flowy pink dress and had her hair and makeup done by T. Cooper for the special event. Une Table by Tania filled the venue with greenery and colorful flowers to create the garden vibe for the occasion. Williams and her guests sipped on \"endless mimosas\" and enjoyed a brunch featuring prime rib, broccolini frittata and crème brûlée French toast. The brunch menus were printed with a custom crest with the baby's initials, L.A.W., included in the design. There was also a champagne toast and cake cutting, during which Williams took a moment to express her gratitude and share her excitement about her daughter's impending arrival. \"It was so special to celebrate this life-changing and extraordinary event with my closest friends and chosen family,\" Williams tells PEOPLE of the baby shower. Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer​​, from celebrity news to compelling human interest stories. When she shared the news of her pregnancy last month, Williams told PEOPLE the baby is a girl, due on Aug. 16. She described her pregnancy as a \"remarkable miracle,\" after having revealed two years ago that she was using her frozen eggs to pursue motherhood via sperm donation and in vitro fertilization (IVF). \"Anybody who's gone through IVF or attempted IVF will tell you so many things have to go right for the final result of this journey to be a baby,\" Williams said. \"That's why I've called this 'my remarkable miracle,' because it really does feel like I've been the recipient of some very enormous favor from God above.\" She also told PEOPLE that motherhood was not always a desire of hers. \"I was not the little girl that grew up fantasizing about having kids and what I would name them and all of that,\" the Equal Justice with Judge Eboni K. Williams star explained. \"That was not my dream or fantasy. I had no real expectation around it.\" Even after completing the process of freezing her eggs at 34, she had no \"surefire plan\" to use them — until she found herself opening up to new possibilities years later. The PEOPLE Puzzler crossword is here! How quickly can you solve it? Play now! \"I was really thinking I would never use [the eggs], whether I got married again or didn't,\" she recalled. \"It was the pandemic and having some real existential conversations within my own self about legacy and life and love and the different ways in which I really wanted to explore family.\" Williams also opened up to PEOPLE about her decision to \"pursue the single motherhood by choice journey\" as she acknowledged how \"extraordinarily stigmatized it still is\" for women. \"My mother Gloria raised me all by myself, and did so in an era and at a time where being a single mother in this country — especially a Black single mother — was one of the most disgraceful things you could do. And in the span of a generation, that's shifted to where women like me are not just embracing it, but also choosing it,\" she said last month. \"It is not the shame-ridden narrative that it used to be. That's not the story,\" she continued. \"These innocent, little babies are so desperately and lovingly wanted that they have mothers who invested exorbitant resources (by way of money, by way of time, by way of what we put our bodies through, etc.) to bring them to this Earth, and to shower them with all the things that all sweet babies deserve. That's love.\"",
        "publish_date": "2024-07-13 18:00:00",
        "authors": [
            "Dave Quinn",
            "Erin Clack"
        ]
    },
    {
        "summary": "Marie Osmond was famously linked to singer Andy Gibb, and remarried her husband Stephen Craig in 2011, 26 years after their divorce",
        "image": "https://people.com/thmb/u_SRYwSu9yYpqAYhTlXEDM5up68=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(919x569:921x571)/marie-osmond-1-5d1c6484fcfc4eb28d5a544a14ff7f18.jpg",
        "sentiment": -0.048,
        "author": "Emily J. Shiffer",
        "language": "en",
        "video": null,
        "title": "Marie Osmond&#39;s Dating History: From Andy Gibb to Stephen Craig",
        "url": "https://people.com/music/marie-osmonds-dating-history-from-andy-gibb-to-stephen-craig/",
        "source_country": "US",
        "id": 251594622,
        "text": "Marie Osmond's love life has had many twists and turns. \"I dated a lot of people and never really publicized it,\" she shared with PEOPLE in 2019. \"I'm not a nun!\" The singer found a fresh start with her husband, Stephen Craig, in 2011 when the pair remarried 26 years after they first divorced in 1985. \"Nothing is an accident,\" Osmond told PEOPLE in 2019 about their reconciliation. \"I am a spiritual person. So [I believe] God has his timing.\" The Donny & Marie star previously dated many famous entertainers, including Andy Gibb and Erik Estrada, before settling down with Craig. She also was married to ex-husband Brian Blosil from 1986 to 2007. Here's a look at Marie Osmond's dating history. Michael McDonald Osmond revealed that Michael McDonald was the first man she ever had a crush on. \"He was probably the first person I had a crush on,\" Osmond told PEOPLE in 2019. \"He asked me to record on an album with him, and I never got over there to do it. I was going to do some background. I felt really bad about that!\" Jeff Crayton Osmond was briefly engaged to Jeff Crayton in 1979, according to the Tampa Bay Times. \"Marriage is a serious thing you don't want to fool around with,\" she told the outlet at the time. \"We had doubts.\" David Cassidy Although she never truly dated David Cassidy, Osmond recalled having a brief interest in him in the past. \"Everybody wanted to date David, and I was like, 'Hmmm I'll check him out', \" Osmond told PEOPLE in 2019. \"We were at a recording studio and I was recording and he was down the hall. And I hear these clogs coming down to the drinking fountain — and I looked at him and I went, 'It's not going to happen! His butt's smaller than mine!' So I couldn't do it.\" Andy Gibb Although it's not clear exactly when Osmond dated Andy Gibb, he appeared on the Donny & Marie variety show in the late 1970s. \"Andy Gibb and I were very dear — loved him,\" Osmond told PEOPLE in 2019. Osmond shared more about her relationship with Gibb, who battled drug addiction during their time together, during an episode of The Talk in October 2019. \"He kept calling me — we had known each other a couple of years and were dating,\" she said. \"One night, he kept calling me and calling me. He was obviously not well. I probably could've done it better, but I just said, 'We're done.' \" Osmond added that while she felt \"really bad,\" she ultimately had had \"enough.\" \"It was something I should have done in person, but it was breaking my heart to see what he was doing to himself,\" she explained. Erik Estrada Osmond has revealed a former relationship with Erik Estrada, however, it is not clear exactly when the pair were together. She confirmed that they were once a couple during a 2019 appearance on Bravo's Watch What Happens Live. \"Did you date Erik Estrada?\" host Andy Cohen asked Osmond. \"Yes, I dated a lot of people ... we just never talked about it,\" she replied. \"Yeah, we were ... he was a very nice guy.\" Brian Blosil Osmond met actor Brian Blosil in October 1985 and they wed in October 1986. Their marriage ended in 2007. The couple had seven children together, including two biological children — Rachael and Matthew — and five adopted children: Jessica, Michael, Brandon, Brianna and Abigail. (Michael died in 2010 at the age of 19.) In 1998, Osmond and Blosil separated for several months as Osmond dealt with postpartum depression. Although they reconciled, they ultimately divorced in 2007. \"Though our marriage is ending, we continue to have a very amicable relationship,\" Osmond and Blosil said in a joint statement at the time. \"Our marriage has always been a faithful one, and neither of us is assigning fault for the divorce.\" Osmond told PEOPLE in 2019 that she rushed into the relationship. \"You have to be so careful not to jump into a relationship after you've been through a sad one,\" she said. \"You really need time on your own. And you need to know that you're a good person in order to find a good person.\" She said that after her painful divorce from Blosil, she \"never wanted to be married again,\" explaining, \"I was like, 'I'm fine, I'm good!' \" She shared more on the marriage, and how she was unhappy, on Winn Claybaugh's Masters podcast in 2020. \"I just went, 'I can't do this anymore,' \" Osmond said. \"And my children came to me and said, 'Mom, please leave. We gotta get out of here.' \" Osmond also shared on the podcast that her marriage to Blosil suffered after a house fire destroyed their home in August 2005. \"It was probably one of the most freeing things that ever happened to me,\" she said of the fire. \"Because I realized this home I had created was a facade to a marriage that wasn't happy for 20 years. I really believe it was God — they say, 'The burning within.' So sometimes these things happen to wake us up.\" Stephen Craig Osmond met Stephen Craig as a teen, and at 22, they married for the first time in 1982. Less than a year later, the couple welcomed their son Stephen, and Osmond found herself at a crossroads in her personal and professional life. \"Everyone was telling me my career was over,\" she told PEOPLE. Eventually, the couple \"had some trouble\" in their marriage, and they divorced in 1985. \"All of a sudden I'm a single mom and I don't know how I'm going to pay my rent, let alone feed my kid,\" Osmond recalled to PEOPLE. \"So I decided I had to get back to work.\" She said she later reconnected with Craig through their son Stephen. They reconciled, and married a second time in 2011. They tied the knot at the Las Vegas Mormon Temple and celebrated at a reception at their Nevada home. At the time, Osmond's brother Donny told Entertainment Tonight, \"Despite what has happened in the past, these two people are right for each other. My sister is so happy.\" Osmond told PEOPLE that her second marriage to Craig is much different than their first. \"The thing about a second marriage is that you realize things you thought were so important, aren't,\" she explained in 2019. \"I love being with my husband. He is the sweetest man I know. He lives to serve and really listens to people's needs.\" Osmond also revealed that their son was a \"little scared\" of his parents getting back together. \"Stephen was getting married and we [realized] we can't go to our son's wedding and not be married,\" she told PEOPLE. \"So we got married a few months before he did. He joked that he never thought it would happen, but it did!\" Osmond shared more about their marriage during the COVID-19 pandemic on Instagram. \"Steve has diabetes and my immune system isn't the greatest so we felt at our tender ages of 29? we should isolate ourselves.?,\" she wrote in a March 2020 post. \"After growing up with a large family of brothers and then 36 years of raising my children, I'm enjoying being alone with my husband. ? It has been a blessing to have that time together especially after being apart for over 25 years!\" The couple enjoys attending BYU football games and spending time in the mountains together.",
        "publish_date": "2024-07-13 18:00:00",
        "authors": [
            "Emily J. Shiffer"
        ]
    },
    {
        "summary": "Playing Alia Atreides in ‘Dune’ at only age 7 “led me to my destiny,” says Alicia Witt",
        "image": "https://people.com/thmb/Waaszk8-7PHbDJ79m6DMiXz_GIA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(745x298:747x300)/alica-witt-dune-tout-071124-f64e9db21af64eeaa7a72968e1fbdd49.jpg",
        "sentiment": 0.306,
        "author": "Jack Smart",
        "language": "en",
        "video": null,
        "title": "Alicia Witt Is No Longer ‘Embarrassed’ by ‘Child Prodigy Label’ After Filming David Lynch’s Dune Aged 7 (Exclusive)",
        "url": "https://people.com/alicia-witt-not-embarrassed-child-prodigy-dune-exclusive-8677539",
        "source_country": "US",
        "id": 251594624,
        "text": "Alicia Witt, who made her feature film debut in 1984’s Dune, is the first to acknowledge that she had a “very unusual childhood.” In fact, as the Longlegs star tells PEOPLE in this week’s issue, what she’s “so grateful for, especially as years have gone on, is the unusualness of my childhood and the fact that I ended up part of David Lynch's Dune at the age of seven.” Now 48, Witt debuted as the psychically powered Alia Atreides, the younger sister of (played by Kyle MacLachlan), messiah of the desert planet Arrakis. Like Denis Villeneuve’s recent Timothée Chalamet-starring movies, the 1984 Dune was adapted from Frank Herbert’s hit sci-fi novel of 1965. “Being on that set of Dune was all about the community that I found and getting to channel the character, feeling her come into me and come out through my mouth and my voice and my body,” she recalls. “That was my first experience in the magic of playing characters. And I knew from the moment I set foot on the set that I wanted to do that for the rest of my life — God willing.” Around the same time as her Hollywood breakout, the Massachusetts native also found a “way of connecting and expressing, which I was craving”: taking piano lessons with accomplished pianists. “Piano was so much of a lifeline for me to connect to other people,” she recalls. Witt began playing the instrument in competitions and received her high-school equivalency credential at age 14, earning her the title of a child prodigy — including in a 1995 feature with PEOPLE around the time she starred as Cybill Shepherd's daughter on the sitcom Cybill. “I was a little embarrassed by the child prodigy label,” she admits. “I hated that term.” But now, especially as a working actress and musician, “I recognize that [acting and playing the piano] led me to my destiny and I don't know what my life would be without all of that. So I'm so grateful that every single thing happened the way it has.” Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer, from juicy celebrity news to compelling human interest stories. Plus, Dune wasn’t just a childhood lightbulb moment of what Witt wanted to pursue for the rest of her life. As she says with a smile, “it all goes back to David Lynch.” The visionary director went on to cast Witt in his iconic 1990 series Twin Peaks and again in 2017’s Twin Peaks: The Return. Her decades-spanning performance as Gersten Hayward, says the actress, is what “sealed the deal” for Longlegs writer-director Osgood Perkins. “It's so magical how these things work out,” says Witt. “I just knew I had to open up and trust David and let the spirit of the moment take over. And channeling Ruth for Longlegs was very much all about that.” Longlegs, costarring Maika Monroe, Nicolas Cage, Blair Underwood and more, is in theaters now.",
        "publish_date": "2024-07-13 18:00:00",
        "authors": [
            "Jack Smart"
        ]
    },
    {
        "summary": "<a href=\"https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL2V1cm8tMjAyNC10YWtlYXdheXMtcm9uYWxkby1tYmFwcGUteWFtYWwtYzMzYTZmMDMxMjk0ODA4MmE0MmY0OThjNDliNTUzMWTSAQA?oc=5\" target=\"_blank\">Euro 2024 takeaways: Lamine Yamal shines and fans party but the big names struggle</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Associated Press</font>",
        "image": "https://dims.apnews.com/dims4/default/11a20a4/2147483647/strip/true/crop/5874x3304+0+305/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F%5B1%2F22%2F%2C%20117%2C%20-69%2C%2065%2C%20-24%2C%20-7%2C%2029%2C%20-102%2C%20-91%2C%20-93%2C%2011",
        "sentiment": 0.271,
        "author": "James Ellingworth",
        "language": "en",
        "video": null,
        "title": "Euro 2024 takeaways: Lamine Yamal shines and fans party but the big names struggle",
        "url": "https://apnews.com/article/euro-2024-takeaways-ronaldo-mbappe-yamal-c33a6f0312948082a42f498c49b5531d",
        "source_country": "us",
        "id": 251595460,
        "text": "DUESSELDORF, Germany (AP) — Young stars emerge and big names underperform. Fans party on the streets of Germany and grumble about controversial VAR decisions. Ahead of Sunday’s final between Spain and England, here’s a look at what we’ve learned from Euro 2024 so far: Young talents Tournament soccer offers a chance for young players to break through. They’re not normally this young. Lamine Yamal has been the star of Euro 2024, especially after his stunning goal against France in the semifinals, which made him the youngest-ever scorer at a men’s European Championship. He turned 17 on Saturday, a day before the final against England in Berlin. German 21-year-olds Jamal Musiala and Florian Wirtz lit up the tournament for the host nation, and another 21-year-old, Xavi Simons, scored a spectacular goal as the Netherlands lost to England in the semifinals. There was disappointment for Spain midfielder Pedri, also 21, whose tournament was ended by a rough challenge from Germany’s Toni Kroos in the quarterfinals. Misfiring superstars This hasn’t been a tournament for Europe’s biggest names to shine. Cristiano Ronaldo could have become the European Championship’s oldest ever scorer at 39, but finished without any goals from five games amid enduring questions about whether Portugal would be a better team without him on the field. His biggest impact was arguably on tournament security as a string of selfie-seeking fans tried to reach him on the field. Kylian Mbappé's tournament started with a broken nose against Austria and ended with France’s semifinal loss to Spain. His only goal was a penalty against already-eliminated Poland. Mbappé's interventions in French politics were arguably more significant than his deeds on the field. Harry Kane is in the final but has often seemed off the pace despite scoring three goals, and Kevin de Bruyne couldn’t inspire an often-toothless Belgian team. Fan buzz After a European Championship held under pandemic restrictions and a World Cup in Qatar, Euro 2024 was a chance for European fans to mass in numbers not seen for years. Colorful fan marches to stadiums — the Dutch march to their semifinal with England was 100,000 strong — lit up the host cities. It was generally good-natured, with only a few minor clashes involving English, Dutch and Serbian fans, not the large-scale violence of Euro 2016 in France. Fans endured an overloaded German train network to get between games, though. Even the Dutch team hit train trouble that forced it to arrange a last-minute charter flight to its semifinal game. VAR controversy It wouldn’t be a big soccer event without heated arguments over the video review system. VAR has strayed far from the original concept unveiled by FIFA in 2016, and a few crucial calls overshadowed key games. Denmark’s Joachim Andersen had his goal ruled out for offside by VAR against Germany before VAR helped award a penalty against him shortly after. Referees and VAR often seemed to take a lenient approach to grappling in the penalty area, but when Dutch defender Denzel Dumfries collided with England’s Harry Kane while trying to block a shot, it was a penalty that changed the course of that semifinal game. “I think that we cannot play properly football and this is due to VAR. It really breaks football,” Netherlands coach Ronald Koeman said. There was no penalty for Germany in the quarterfinals when the ball struck Spain defender Marc Cucurella’s hand. German fans jeered Cucurella in Spain’s semifinal game with France as a result. No small teams There were no easy opponents at Euro 2024. Even with several smaller soccer nations playing, no team lost all its games, the first time that happened at a men’s European Championship since it was an eight-team event in 1992. Georgia beat Portugal and briefly led Spain in the round of 16 in a fearless debut campaign. Albania had the lead in two of its three games and scored a quick record-breaking goal. Slovenia didn’t lose a game in regular play and was only eliminated by Portugal in a penalty shootout. ___ AP Sports Writers Steve Douglas in Berlin and Graham Dunbar in Geneva contributed to this report. ___ AP Euro 2024: https://apnews.com/hub/euro-2024",
        "publish_date": "2024-07-13 18:08:28",
        "authors": [
            "James Ellingworth"
        ]
    },
    {
        "summary": "<a href=\"https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL2V1cm8tMjAyNC10YWtlYXdheXMtcm9uYWxkby1tYmFwcGUteWFtYWwtYzMzYTZmMDMxMjk0ODA4MmE0MmY0OThjNDliNTUzMWTSAQA?oc=5\" target=\"_blank\">Euro 2024 takeaways: Lamine Yamal shines and fans party but the big names struggle</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Associated Press</font>",
        "image": "https://dims.apnews.com/dims4/default/11a20a4/2147483647/strip/true/crop/5874x3304+0+305/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F%5B1%2F22%2F%2C%20117%2C%20-69%2C%2065%2C%20-24%2C%20-7%2C%2029%2C%20-102%2C%20-91%2C%20-93%2C%2011",
        "sentiment": 0.271,
        "author": "James Ellingworth",
        "language": "en",
        "video": null,
        "title": "Euro 2024 takeaways: Lamine Yamal shines and fans party but the big names struggle",
        "url": "https://apnews.com/article/euro-2024-takeaways-ronaldo-mbappe-yamal-c33a6f0312948082a42f498c49b5531d",
        "source_country": "us",
        "id": 251595460,
        "text": "DUESSELDORF, Germany (AP) — Young stars emerge and big names underperform. Fans party on the streets of Germany and grumble about controversial VAR decisions. Ahead of Sunday’s final between Spain and England, here’s a look at what we’ve learned from Euro 2024 so far: Young talents Tournament soccer offers a chance for young players to break through. They’re not normally this young. Lamine Yamal has been the star of Euro 2024, especially after his stunning goal against France in the semifinals, which made him the youngest-ever scorer at a men’s European Championship. He turned 17 on Saturday, a day before the final against England in Berlin. German 21-year-olds Jamal Musiala and Florian Wirtz lit up the tournament for the host nation, and another 21-year-old, Xavi Simons, scored a spectacular goal as the Netherlands lost to England in the semifinals. There was disappointment for Spain midfielder Pedri, also 21, whose tournament was ended by a rough challenge from Germany’s Toni Kroos in the quarterfinals. Misfiring superstars This hasn’t been a tournament for Europe’s biggest names to shine. Cristiano Ronaldo could have become the European Championship’s oldest ever scorer at 39, but finished without any goals from five games amid enduring questions about whether Portugal would be a better team without him on the field. His biggest impact was arguably on tournament security as a string of selfie-seeking fans tried to reach him on the field. Kylian Mbappé's tournament started with a broken nose against Austria and ended with France’s semifinal loss to Spain. His only goal was a penalty against already-eliminated Poland. Mbappé's interventions in French politics were arguably more significant than his deeds on the field. Harry Kane is in the final but has often seemed off the pace despite scoring three goals, and Kevin de Bruyne couldn’t inspire an often-toothless Belgian team. Fan buzz After a European Championship held under pandemic restrictions and a World Cup in Qatar, Euro 2024 was a chance for European fans to mass in numbers not seen for years. Colorful fan marches to stadiums — the Dutch march to their semifinal with England was 100,000 strong — lit up the host cities. It was generally good-natured, with only a few minor clashes involving English, Dutch and Serbian fans, not the large-scale violence of Euro 2016 in France. Fans endured an overloaded German train network to get between games, though. Even the Dutch team hit train trouble that forced it to arrange a last-minute charter flight to its semifinal game. VAR controversy It wouldn’t be a big soccer event without heated arguments over the video review system. VAR has strayed far from the original concept unveiled by FIFA in 2016, and a few crucial calls overshadowed key games. Denmark’s Joachim Andersen had his goal ruled out for offside by VAR against Germany before VAR helped award a penalty against him shortly after. Referees and VAR often seemed to take a lenient approach to grappling in the penalty area, but when Dutch defender Denzel Dumfries collided with England’s Harry Kane while trying to block a shot, it was a penalty that changed the course of that semifinal game. “I think that we cannot play properly football and this is due to VAR. It really breaks football,” Netherlands coach Ronald Koeman said. There was no penalty for Germany in the quarterfinals when the ball struck Spain defender Marc Cucurella’s hand. German fans jeered Cucurella in Spain’s semifinal game with France as a result. No small teams There were no easy opponents at Euro 2024. Even with several smaller soccer nations playing, no team lost all its games, the first time that happened at a men’s European Championship since it was an eight-team event in 1992. Georgia beat Portugal and briefly led Spain in the round of 16 in a fearless debut campaign. Albania had the lead in two of its three games and scored a quick record-breaking goal. Slovenia didn’t lose a game in regular play and was only eliminated by Portugal in a penalty shootout. ___ AP Sports Writers Steve Douglas in Berlin and Graham Dunbar in Geneva contributed to this report. ___ AP Euro 2024: https://apnews.com/hub/euro-2024",
        "publish_date": "2024-07-13 18:08:28",
        "authors": [
            "James Ellingworth"
        ]
    },
    {
        "summary": "The pandering persists, thus why else would ESPN choose Serena Williams to host an awards show that celebrates and rewards sports?",
        "image": "https://nypost.com/wp-content/uploads/sites/2/2024/07/newspress-collage-bb41v2v8a-1720893086817.jpg?quality=75&strip=all&1720878793&w=1200",
        "sentiment": -0.51,
        "author": "Phil Mushnick",
        "language": "en",
        "video": null,
        "title": "Serena Williams' angry Harrison Butker takedown part of star's latest ESPN pass",
        "url": "https://nypost.com/2024/07/13/sports/serena-williams-angry-harrison-butker-takedown-part-of-stars-latest-espn-pass/",
        "source_country": "us",
        "id": 251597792,
        "text": "It’s often better to be known by one’s enemies than their friends. Thus the big winner from Thursday’s desperate-for-attention ESPYs was Chiefs kicker Harrison Butker, who was forced to just sit there as 43-year-old host and media-entitled career brat Serena Williams attacked him for his conservative Christian sensibilities expressed by Butker, a Catholic, to a Catholic college’s graduating class. Williams disagreed with Butker’s family-first take on parenting and motherhood, thus he would suffer her angry, direct and classless condemnation. And to that ESPN’s audience of intolerant pro-tolerance sycophants and panderers applauded or otherwise indulged Williams’ verbal ambush, a scene reminiscent of the U.S. Open when Williams screamed at a lineswoman, “I swear to God I’ll f—ing take the ball and shove it down your f—ing throat!” That, and countless other highly public episodes of rotten, childish and even threatening behavior — win or lose — were ignored by ESPN’s lead tennis voices, fellow tantrum-tosser John McEnroe and Chris Evert, and virtually all media during Williams’ ungracious and ungrateful “farewell tour.” For crying out loud, this woman, antithetical to common decency and even minimal sportsmanship, was portrayed as a role model! I don’t know Harrison Butker’s parents, but I’m familiar with Williams’ father, Richard Williams — the father of nine children from four mothers and a loud-mouthed, race-baiting miscreant unashamed to utter anti-white and anti-Jewish slurs. Sports Illustrated, which lost a lot of credibility and subscribers among know-better readers when it named Serena “Sportsperson of the Year,” attributed Richard’s bigotry to his “flakiness.” And there’s evidence that her petulance and self-entitlement persists in the active form of other female tennis pros who have no compunction in acting like on-court louts. To that unfinished end, she likely remains inspirational, a genuine role model. The pandering persists, thus why else would ESPN choose her to host an awards show that celebrates and rewards sports? But we were long conditioned by ESPN to expect the worst from ESPN, like “Manny being Manny.” The only surprising thing about this ESPYs was that LeBron James wasn’t chosen Father of the Year. Back afta this Francesa foul-up It’s likely becoming too easy for the Funhouse folks who compile and share the bogus genius of sports media know-it-all/gasbags such as Colin Cowherd and Mike Francesa at the @BackAftaThis account on Twitter, er, X. Last week, @BackAftaThis found Francesa doing what he does best: not only being consistently wrong, but being instantly, comically and colossally wrong. On his “I’ll Never Host a Podcast” podcast, he spoke of the chances of a Yankee hitting two home runs in a game: “You’re gonna be waiting a long time for someone other than [Juan] Soto or [Aaron] Judge to get it done.” Well, “a long time” lasted about two hours, as Ben Rice that day hit three homers. Georgia will soon swap nicknames with Georgia Tech to become “The Ramblin’ Wrecks.” Last week, there two more arrests of UGa football recruits for reckless driving. That’s four just this offseason. The team’s total arrests for reckless driving — including one that caused a player fatality and the death of a football staffer — has been difficult to keep current. But the number the past two years now is at least 24, according to the Athens (Ga.) Banner Herald. Head coach Kirby Smart, who at $13 million per does only what the “school” allows him to do, is known for handling such matters “internally.” Regardless, Georgia is again ranked No. 1 by ESPN’s dutiful automatons — no questions asked, no answers needed. We’ve lately tuned in to Mets telecasts to hear that their bullpen is exhausted, as if that’s a matter of bad fortune as opposed to managerial design. So Thursday, the Mets led the Nationals, 5-0, after six, when Carlos Mendoza brought in new guy Phil Maton, who made one, two, three with two strikeouts on 10 pitches. And then he was pulled. In a 7-0 final, Mendoza used five pitchers. Why? I’ll hang up and listen to your answer. I’m a soccer fan. I admit it. As Maynard G. Krebs said, “I’m not bad, just weak.” But as I watch all these international championship matches, I can’t help but wonder: If Julinho, the player, is hollering at Hans, the referee, and Hans hollers back, in what language or languages are they hollering? It’s like when Gary Sanchez went to the mound to talk matters over with Masahiro Tanaka. Both relied on interpreters, one Spanish-to English, the other Japanese-to-English. Still, both covered their mouths with their gloves to make sure no one could see what the were saying. Money for players, not for stadium Apparently impressed by the taxpayer-funded, loan-enabled $250 million debt accrued by Rutgers’ Big Ten Fever-Stricken athletic department — a bridge loan too far — Penn State has borrowed $700 million to improve Beaver Stadium. With NIL payments and other come-hither, survival-of-the-wealthiest gifts to football recruits, I’d fire the loan officer. Michael Kay recently threw one of his on-air, self-serving fits when his ESPN-NY radio show included an ad for SNY that unsurprisingly pitched the Mets’ announcers as the best in the business — as if Kay was shocked by such puffery in an advertisement. Thursday, during the Yankees game on YES — imagine: a Yankees game on YES! — Kay dutifully and enthusiastically read a promo for another competitor: the All-Star Game “on Fox!” It might be over before it starts for Fox’s new, hideously overpriced — 10 years, $375 million — lead analyst Tom Brady. He has sought broadcasting advice from NBC’s hideously overpaid and wildly unpopular blowhard analyst Cris Collinsworth. That’s like taking singing lessons from Yoko Ono. ESPN’s Wimbledon “coverage” is again “look what we can do!” TV. And it’s always about the last thing or the next thing — the sell — rather than what we tuned in to watch and what ESPN paid for and promoted: live tennis. The view of good matches is split-screened to see big names warming up for their coming match or for interviews with a just-finished winner who is “happy to advance.” As per the NBA’s unreal world salaries, nothing recedes like excess. Especially those excesses — greed — unabashedly spoken in public. Paul George, at 34 his best NBA All-Star years likely in the past tense, says he rejected the Clipper’s three-year, $150 million renewal to sign with the 76ers, as L.A. didn’t include a no-trade clause nor the four-year, $212 million the Sixers dangled. Thus, he said, the offer was “disrespectful.” He said this on his own podcast as if he anticipated “Amen to that!” from an audience populated with those who can no longer afford to attend NBA games. Before he signed with Philly, George’s career NBA salary totaled a disrespectful $305 million. Perhaps that’s why reader Ed McKenna, after hearing that LeBron James had “opted out” of his Lakers contract, wrote it’s a good idea: “I’m opting out, too.”",
        "publish_date": "2024-07-13 18:10:26",
        "authors": [
            "Phil Mushnick"
        ]
    },
    {
        "summary": "&#34;My ethical obligations compelled me to withdraw,&#34; Erlinda Ocampo Johnson tells PEOPLE",
        "image": "https://people.com/thmb/6whSy4x_twe4UhA_AOFwPvtd_q4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(745x244:747x246)/alec-baldwin-erlinda-johnson-ocampo-court-071324-68cf468781724eb989a0047c4872b199.jpg",
        "sentiment": -0.358,
        "author": "Brenton Blanchet,Eric Andersson",
        "language": "en",
        "video": null,
        "title": "Why Alec Baldwin&#39;s Rust Prosecutor Shockingly Quit Case Before Judge Dismissed It: &#39;Ethical Obligations&#39;",
        "url": "https://people.com/why-alec-baldwin-prosecutor-shockingly-quit-case-before-dismissal-8677658",
        "source_country": "US",
        "id": 251600546,
        "text": "Erlinda Ocampo Johnson, the special prosecutor who unexpectedly resigned from the Rust involuntary manslaughter case against Alec Baldwin before it was dismissed by a judge this week, is opening up about her decision to do so. \"Prosecutors have high ethical obligations, and when a prosecutor learns of evidence that could be material to the defense was not disclosed, the right thing to do would be to dismiss a case,\" she tells PEOPLE. \"When that was not done, my ethical obligations compelled me to withdraw,\" Ocampo Johnson adds. Baldwin, 66, was on trial nearly three years after the gun he was holding on the set of his film Rust in October 2021 discharged and killed cinematographer Halyna Hutchins and injured director Joel Souza. The case itself was dismissed on Friday, July 12, after the 30 Rock alum's attorneys argued that prosecutors had buried evidence — specifically evidence that his attorney Luke Nikas argued would've shed light onto how live ammunition was brought to the set.Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer, from celebrity news to compelling human interest stories. After Judge Mary Marlowe Sommer had Baldwin's charge dropped, Ocampo Johnson also spoke with NewsNation's Chris Cuomo about why she resigned from the case before the dismissal was announced. \"We have an obligation as prosecutors, we have an obligation not only to the people, but to the defendant and our obligation is to make sure that all the evidence is turned over,\" Ocampo Johnson said of her position. \"We don't get to decide what the defense is going to be. Our job is to ensure transparency, and to ensure that the defendant has everything that the prosecution has gathered. What they do with it, that's up to them.” She added that she has \"ethical obligations and personally, I have moral obligations.\" “My ethical obligation, and my moral obligations really are not that different,\" Ocampo Johnson continued. \"And so when I see that something isn't right, and when I see that the law isn't followed, I don't care who you are, where you are, you make the right decision. And for me, the right decision was to walk up to the judge and ask to be allowed to withdraw before that circus of a hearing got underway.\" A prosecution is required to share any material evidence with the defense that could work in the accused's favor in accordance with the Brady rule. In the Rust case, ammunition was turned over from a man named Troy Teske (a friend of the father of convicted Rust armorer Hannah Gutierrez-Reed), who thought it was connected to the case. Baldwin's legal team argued that this was \"critical evidence in the case that was never disclosed to us.\" Ocampo Johnson told NewsNation after the dismissal that she herself \"learned about this evidence when the public learned about it yesterday, late afternoon.\" She also said that she was \"not involved in the Hannah Gutierrez case at all\" and \"was not aware that this individual had taken this ammunition to the sheriff's department and provided it to the officers.\" (Gutierrez-Reed was previously found guilty of involuntary manslaughter for loading a live round into Baldwin's gun.) While Ocampo Johnson resigned from the case, she told Cuomo that based on her \"evaluation of the evidence that I was privy to,\" citing clips from the Rust set, Baldwin did \"engage in some horseplay with this gun.\" She cited an interview by investigators in which someone claimed he \"allowed Mr. Baldwin to use him kind of as a target to shoot blanks at him.\" \"You don't use another person as a target, as a human target, so that could potentially be reckless,\" she said. \"And so, you know, he wasn't charged with intentional homicide. There's no question for me, there's no question Mr. Baldwin did not intend to do this. But the question is, was there wanton and recklessness and so that's why I did believe in the case. I had no idea that this other evidence had not been turned over.\" Ocampo Johnson also added to NBC News that she \"believed that the right decision would have been a dismissal\" given the circumstances. She said that she also believed there was \"some reckless behavior on the set.\" “I don’t think it was intentional,\" she added of the evidence mix-up. \"I really do not believe that. I think it was just something that — it wasn’t turned over, and it should have been.” Baldwin, who now cannot be charged with involuntary manslaughter again, still currently faces civil lawsuits.",
        "publish_date": "2024-07-13 18:20:09",
        "authors": [
            "Brenton Blanchet",
            "Eric Andersson"
        ]
    }
]
