[
    {
        "summary": "Rose Namajunas took home the victory in the UFC Denver main event with a balanced performance against a game, but overmatched Tracy Cortez.",
        "image": "https://imageio.forbes.com/specials-images/imageserve/669362d028ac46e14897496c/0x0.jpg?format=jpg&crop=1682,947,x0,y66,safe&height=900&width=1600&fit=bounds",
        "sentiment": -0.113,
        "author": "Brian Mazique,Contributor",
        "language": "en",
        "video": null,
        "title": "UFC Denver Results: Highlights, Finishes And Scorecards",
        "url": "https://www.forbes.com/sites/brianmazique/2024/07/14/ufc-denver-results-highlights-finishes-and-scorecards/",
        "source_country": "US",
        "id": 251712266,
        "text": "Share to Facebook Share to Twitter Share to Linkedin DENVER, COLORADO - JULY 13: (L-R) Rose Namajunas punches Tracy Cortez in a flyweight fight during ... [+] the UFC Fight Night event at Ball Arena on July 13, 2024 in Denver, Colorado. (Photo by Josh Hedges/Zuffa LLC via Getty Images) Zuffa LLC via Getty Images Rose Namajunas showed Tracy Cortez there are levels to the game on Saturday night in the main event of UFC Denver. In Namajunas’ adopted home, she used a mixture of clean, effective striking and timely takedowns to take the unanimous decision victory (49-46, 49-46, 48-47). Namajunas floored Cortez in the first round with a left hook and knocked off one of her opponent’s eyelashes with a punch in the frame as well. After the striking set the tone, Namajunas put together a series of textbook takedowns and top control to confirm her dominance. The judge who scored the fight 48-47 might have had some explaining to do if Namajunas hadn’t come out on top. Cortez fought well in the fifth round, showing appropriate determination to chase the finish she needed to get the win. But that’s the only round you could argue should have gone in her favor. Thankfully, that questionable card didn’t lead to a change in the bottom-line outcome. While Namajunas won, Cortez made a strong account of herself in her first main event showcase. She stepped in as a late replacement for Maycee Barber, who was forced out of the fight due to an injury. Namajunas showed interest in fighting for the flyweight title, which Alexa Grasso currently holds. If Grasso can get past Valentina Shevchenko in their as-yet-scheduled third meeting, that could be next for Namajunas. Forbes VettedFor You The Best Gaming Laptops Under $1,000: Boost Your Games For Less By Jon Martindale Contributor If not, Namajunas became the latest female fighter to express an interest in a BMF fight. Her former rival Joanna Jędrzejczyk has also said she would come out of retirement for a BMF title fight. I wrote a list of female fighters who would be a good fit for that event here. Here is a look at all of the results, highlights posted from Spinnin Backfist on X, and bonus winners. Muslim Salikhov defeats Santiago Ponzinibbio by split decision (28-29, 29-28, 29-28) DENVER, COLORADO - JULY 13: (R-L) Muslim Salikhov of Russia punches Santiago Ponzinibbio of ... [+] Argentina in a welterweight fight during the UFC Fight Night event at Ball Arena on July 13, 2024 in Denver, Colorado. (Photo by Josh Hedges/Zuffa LLC via Getty Images) Zuffa LLC via Getty Images To be quite honest, this was easily the biggest letdown of the evening. There was a hope that the two established strikers would put on a show similar to what we saw in the fight that preceded them. Unfortunately, that wasn’t the case. Salikhov got the slight edge by being just slightly busier than Ponzinibbio in a fight that was poorly placed as the co-main event. Jean Silva defeats Drew Dober by TKO (doctor’s stoppage) at 1:28 of Round 3 DENVER, COLORADO - JULY 13: (L-R) Jean Silva of Brazil punches in a lightweight fight during the ... [+] UFC Fight Night event at Ball Arena on July 13, 2024 in Denver, Colorado. (Photo by Josh Hedges/Zuffa LLC via Getty Images) Zuffa LLC via Getty Images Silva continued his impressive run with a third-round TKO win over Denver fan-favorite Drew Dober. Silva’s power and chin were on display as he outfought Dober, opening up a nasty gash on the latter’s right eyebrow. The gash was so bad, referee Herb Dean asked for the Octagon doctor to take a look at the gash, and the decision was quickly made to call a halt to the fight. This was an excellent fight and the scrap that the Denver crowd seemed to be the most plugged into the action. Gabriel Bonfim defeats Ange Loosa by unanimous decision (30-27, 30-27, 29-28) DENVER, COLORADO - JULY 13: (L-R) Gabriel Bonfim of Brazil knees Ange Loosa of the Congo in a ... [+] welterweight fight during the UFC Fight Night event at Ball Arena on July 13, 2024 in Denver, Colorado. (Photo by Josh Hedges/Zuffa LLC via Getty Images) Zuffa LLC via Getty Images Bonfim bounced back from the only loss of his professional MMA career in his last fight with a strong performance in his win over Loosa. Bonfim shook off several takedown attempts and Loosa’s efforts to manhandle him. Instead, the biggest differences were the Brazilian’s boxing and work out of the Thai clinch. Bonfim is back on track and again one to watch at welterweight. I can imagine him clashing with someone like Joaquin Buckley in the next year or so. Julian Erosa defeats Christian Rodriguez by submission (guillotine) at 4:49 of Round 1. DENVER, COLORADO - JULY 13: (L-R) Julian Erosa submits Christian Rodriguez in a featherweight fight ... [+] during the UFC Fight Night event at Ball Arena on July 13, 2024 in Denver, Colorado. (Photo by Josh Hedges/Zuffa LLC via Getty Images) Zuffa LLC via Getty Images Erosa and Rodriguez looked like they were headed for Fight of the Night honors, but the former took full advantage of a leg-sweep takedown and quickly transitioned to a guillotine that forced a quick tap out. Take a look: Abdul Razak Alhassan vs Cody Brundage ends in a no contest after Alhassan landed two illegal blows to the back of Brundage’s head. DENVER, COLORADO - JULY 13: (R-L) Abdul Razak Alhassan of Ghana punches Cody Brundage in a ... [+] featherweight fight during the UFC Fight Night event at Ball Arena on July 13, 2024 in Denver, Colorado. (Photo by Josh Hedges/Zuffa LLC via Getty Images) Zuffa LLC via Getty Images No one can say for sure how badly Brundage was hurt from the two elbows he took to the back of the head, but because it happened during a time when Alhassan seemed to be on the cusp of victory, Brundage’s decision not to continue felt a little fishy. Add in the fact that he’s made similar decisions in the past against Jacob Malkoun in September 2023; things felt even more shaky. As it is, Brundage seems to have escaped his fifth loss in his last seven fights. UFC Denver Prelim Results Charles Johnson defeats Joshua Van by knockout (right uppercut) at 0:20 of Round 3 DENVER, COLORADO - JULY 13: Charles Johnson punches Joshua Van of Myanmar in a flyweight fight ... [+] during the UFC Fight Night event at Ball Arena on July 13, 2024 in Denver, Colorado. (Photo by Josh Hedges/Zuffa LLC via Getty Images) Zuffa LLC via Getty Images In an excellent performance from the St. Louis native, Johnson took the decision out of the judges' hands with an explosive start to the third round. I had Johnson winning the first round and losing the second, but it wouldn't have been the biggest shock if it was even heading into the final frame. Johnson landed a right cross and then an uppercut as he chased a dazed Van to get the victory. Take a look: Jasmine Jasudavicus defeats Fatima Kline by unanimous decision (30-27, 30-27, 30-27) DENVER, COLORADO - JULY 13: (L-R) Jasmine Jasudavicius of Canada grapples Fatima Kline in a ... [+] flyweight fight during the UFC Fight Night event at Ball Arena on July 13, 2024 in Denver, Colorado. (Photo by Josh Hedges/Zuffa LLC via Getty Images) Zuffa LLC via Getty Images Jasudavicus proved too big, strong, and dominant on the ground for Kline. Aside from a brief moment in the third when Jasudavicus allowed the fight to stay standing, she controlled almost every moment of the fight en route to the easy unanimous decision win. Montel Jackson defeats Da’Mon Blackshear by knockout (left hand) at 0:18 of Round 1 DENVER, COLORADO - JULY 13: (L-R) Montel Jackson punches Da'Mon Blackshear in a bantamweight fight ... [+] during the UFC Fight Night event at Ball Arena on July 13, 2024 in Denver, Colorado. (Photo by Josh Hedges/Zuffa LLC via Getty Images) Zuffa LLC via Getty Images When Jackson made his UFC debut on the Dana White Contender Series in 2018, I believed he had what he needed to become a title contender. He is beginning to come into that form. Jackson's victory was swift and decisive, taking only 18 seconds to dismantle Blackshear with a powerful 1-2 combination that secured him the KO victory. Take a look: Luana Santos defeats Mariya Agapova by submission (rear-naked choke) at 3:27 of Round 1 DENVER, COLORADO - JULY 13: Luana Santos of Brazil submits Mariya Agapova of Kazakstan in a ... [+] flyweight fight during the UFC Fight Night event at Ball Arena on July 13, 2024 in Denver, Colorado. (Photo by Josh Hedges/Zuffa LLC via Getty Images) Zuffa LLC via Getty Images Santos is a budding superstar. She understands the entertainment aspect of the sport, and she is a dangerous and multi-faceted fighter in the Octagon. Santos dispatched Agapova via submission in the first round, which triggered her signature celebration. Andre Petroski defeats Josh Fremd by unanimous decision (30-27, 30-27, 30-27) DENVER, COLORADO - JULY 13: (R-L) Andre Petroski elbows Josh Fremd in a featherweight fight during ... [+] the UFC Fight Night event at Ball Arena on July 13, 2024 in Denver, Colorado. (Photo by Josh Hedges/Zuffa LLC via Getty Images) Zuffa LLC via Getty Images In his last fight, Petroski rebounded from an odd KO loss to dominate Fremd with his top pressure. Petroski needed this win in the worst way. With the dominant win, he avoided a three-fight losing streak. You never know; it could have saved him from landing on the cut line. Evan Elder defeats Darrius Flowers by submission (arm-triangle choke) at 1:46 of Round 2 DENVER, COLORADO - JULY 13: (L-R) Evan Elder submits Darrius Flowers in a welterweight fight during ... [+] the UFC Fight Night event at Ball Arena on July 13, 2024 in Denver, Colorado. (Photo by Josh Hedges/Zuffa LLC via Getty Images) Zuffa LLC via Getty Images Elder took out Flowers to open the show in Denver. The two men put on a good show in the first round, but Elder’s advantage on the ground in the second led to the victory. Take a look: The UFC is back at the Apex in Las Vegas next weekend for a women’s strawweight tile featuring Amanda Lemos vs. Virna Jandiroba. Follow me on Twitter. Brian Mazique Following Editorial Standards Print Reprints & Permissions",
        "publish_date": "2024-07-14 05:34:03",
        "authors": [
            "Brian Mazique",
            "Contributor"
        ]
    }
]
