[
    {
        "summary": "<a href=\"https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL2FsbHN0YXItZ2FtZS10ZXhhcy1yYW5nZXJzLWJhbGxwYXJrLWFybGluZ3Rvbi1hY2JiZmE0OWMwMDQ4Yzc1ZDRkZDcyMTk5OWM2ZTk5YtIBAA?oc=5\" target=\"_blank\">The Texas Rangers grew up as a franchise when they hosted the All-Star Game 29 years ago</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Associated Press</font>",
        "image": "https://dims.apnews.com/dims4/default/35210f8/2147483647/strip/true/crop/4800x2700+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F%5B-%2F79%2F%2C%2026%2C%20-60%2C%20-84%2C%20-40%2C%2024%2C%2042%2C%2016%2C%2024%2C%20-58%2C%2031%2C%2",
        "sentiment": 0.169,
        "author": "Stephen Hawkins",
        "language": "en",
        "video": null,
        "title": "The Texas Rangers grew up as a franchise when they hosted the All-Star Game 29 years ago",
        "url": "https://apnews.com/article/allstar-game-texas-rangers-ballpark-arlington-acbbfa49c0048c75d4dd721999c6e99b",
        "source_country": "us",
        "id": 251558396,
        "text": "ARLINGTON, Texas (AP) — Former Rangers president Tom Schieffer saw the 1995 All-Star Game at their new ballpark as being like a graduation ceremony for the franchise that already had been in Texas for more than two decades. All of the pomp and circumstance was at The Ballpark in Arlington that had opened the previous season, the one that ended prematurely in August and without a World Series after players went on strike. The Midsummer Classic was Major League Baseball’s first signature event after that. “The strike had such a devastating impact on baseball the year before, and so ’95 was kind of trying to get things back into a normal All-Star Game,” Schieffer said. “But also I think we really tried to make an effort to celebrate the game as opposed to it just being something just for the Rangers.” Before opening their retro-style ballpark that featured nods to some historic venues, the Rangers called old Arlington Stadium home. That had been a minor league ballpark before the Washington Senators moved to Texas in 1972. “Frankly, the Rangers didn’t have a major league ballpark before that,” Schieffer said. “And because of it, people really had a great reaction to it. And I think it changed the perception that the rest of baseball had about the Rangers.” The club has since moved across the street and is now in the fifth season under the retractable roof at Globe Life Field. The All-Star Game will be held there Tuesday night, after the workout and Home Run Derby the previous day. Schieffer was an early investor with a group that bought the Rangers in 1989, led by George W. Bush, before he was Texas governor and the 43rd president of the United States. The following year, Schieffer was put in charge of ballpark development and negotiated a public-private partnership with Arlington that led to the stadium that hosted the first All-Star Game in the Dallas area. “For the first time, the world really came to Arlington for a big event,” said Chuck Morgan, the team’s public address announcer for all but one season since 1983. There never was a playoff game at old Arlington Stadium, where the biggest highlights were Nolan Ryan getting his 5,000th career strikeout on Aug. 22, 1989, two years before throwing his seventh no-hitter at age 44. Hall of Fame third baseman George Brett of the Kansas City Royals got the last of his 3,154 career hits in that stadium’s final game on Oct. 3, 1993. A Super Bowl, an NBA All-Star Game, an NCAA men’s Final Four and the first championship game in college football’s playoff era (2014 season) have since been played nearby at the home of the NFL’s Dallas Cowboys — another retractable roof stadium that opened in 2009. The Rangers won their first World Series title last season. They also made back-to-back World Series appearances in 2010 and ’11 at their old ballpark that still stands and looks much the same from the outside, even though it can no longer host an MLB game. After the Rangers’ final game there in 2019, the playing surface was reconfigured primarily for football, including artificial turf throughout and the removal of the visitors dugout and about a dozen rows of seats on what was the third-base side. The UFL’s Dallas Renegades, a Major League Rugby team and a Major League Soccer reserve team call the stadium home now. MLB is utilizing the old ballpark this week as part of All-Star Village, and Schieffer hopes fans who enter the old park can relive some old memories and “just the love of baseball.” But he hasn’t been in there since the last Rangers game there, and he has no plan to go inside. Schieffer said someone who visited frequently when it was a baseball stadium told him after the conversion: “Don’t go back. It’ll break your heart.” “And I don’t want to do that,” Schieffer said. “We consciously built the ballpark so it could not be used as a football field. We didn’t leave enough space for it. When they changed it and made it a football field, they had to take part of it out.” Schieffer prefers to cherish the memories of what he considered a baseball cathedral. ___ AP MLB: https://apnews.com/MLB",
        "publish_date": "2024-07-13 16:33:50",
        "authors": [
            "Stephen Hawkins"
        ]
    },
    {
        "summary": "Fetterman has repeatedly gone to bat for Biden. But Politico reported that few Democratic senators joined him when he asked if Biden should stay in the race.",
        "image": "https://i.insider.com/6692a4875439fb59cebd28fe?width=1136&format=jpeg",
        "sentiment": -0.298,
        "author": "John L. Dorman",
        "language": "en",
        "video": null,
        "title": "Fetterman asks Senate Dems if Biden should remain, few agree: report",
        "url": "https://www.businessinsider.com/john-fetterman-biden-campaign-senate-democrats-support-lunch-report-2024-7",
        "source_country": "US",
        "id": 251565016,
        "text": "Since joining the upper chamber last year, Sen. John Fetterman has been one of President Joe Biden's strongest political allies.And after Biden's disastrous debate performance — which has led to a chorus of congressional Democrats asking the president to step aside as the party's presidential nominee — the Pennsylvania lawmaker has doubled down in his support of the embattled leader.But so far, many Senate Democrats appear highly skeptical of Biden's chances in November, despite only one Democratic senator publicly calling on the President to forgo his reelection bid.During a Senate Democratic lunch on Thursday — where Biden's top campaign aides spoke about his polling and a path forward — Fetterman voiced his frustration at the pessimism in the room regarding the president's chances, Politico reported.\"You have legacies, too,\" Fetterman told the senators who were present in the room, according to the outlet. (Some senators had already left the meeting before Fetterman rose to speak, Politico reported.)The first-term lawmaker also questioned senators about what their legacies would look like if they turned on Biden over a bad debate, according to the report. When Fetterman asked his fellow Democrats if they'd want to see Biden continue in the race, only a handful of people in the room — four in total — joined him in agreement, according to Politico.The lawmakers who stood with Fetterman included Sens. Chris Coons of Delaware and Tammy Duckworth of Illinois, per the report.Democratic senators have largely remained mum on Biden's chances in public despite their long-standing support of the president's legislative priorities, but their reported views behind closed doors reveal the hesitancy that still permeates the caucus.For weeks, Fetterman has looked to dunk on Democrats who have gone against Biden, arguing that their lack of support only serves to embolden former President Donald Trump's campaign.\"I refuse to join the Democratic vultures on Biden's shoulder after the debate,\" the senator wrote on X after the June debate. \"No one knows more than me that a rough debate is not the sum total of the person and their record.\"Fetterman — who faced criticism from some Democrats after his own debate performance in the high-stakes 2022 Senate race which featured then-GOP candidate and celebrity doctor Mehmet Oz — brushed aside naysayers that year.And he has done the same for Biden — who has insisted that he's not leaving the presidential race — ahead of the general election.During a June appearance on \"Fox News Sunday,\" Fetterman compared his campaign situation with that of the president.\"We had a difficult debate, and yet we still managed to go on to win,\" he said at the time. \"One debate is not a career.\"",
        "publish_date": "2024-07-13 16:42:53",
        "authors": [
            "John L. Dorman"
        ]
    },
    {
        "summary": "&#34;I can&#39;t let anything out of the bag, but right now I&#39;m in full football mode after golf,&#34; the NFL star said",
        "image": "https://people.com/thmb/InMhEajtQ0J3AfKOsWFGfqHr9g8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/travis-kelce-taylor-swift-eras-tour-london-062424-4673f4cc7b2843d4845500aa58f43e2a.jpg",
        "sentiment": 0.171,
        "author": "Brenton Blanchet",
        "language": "en",
        "video": null,
        "title": "Travis Kelce Says He&#39;s Having the &#39;Funnest&#39; Year of His Life — and Reveals Whether He&#39;ll Perform Again with Taylor Swift",
        "url": "https://people.com/travis-kelce-reveals-whether-he-will-perform-with-taylor-swift-again-golf-channel-interview-8677645",
        "source_country": "US",
        "id": 251564788,
        "text": "Travis Kelce is already calling 2024 the \"funnest year of my life.\" During his appearance at the 2024 American Century Championship in Nevada on Friday, July 12, the Kansas City Chiefs tight end, 34, caught up with Golf Channel about all that's gone on in the past few months. At one point, the NFL star discussed whether fans can expect him to hit the stage again with girlfriend Taylor Swift, 34, during her ongoing Eras Tour. \"It's been the funnest year of my life, I can definitely say that,\" Kelce told the outlet during the celebrity tournament at the Edgewood Tahoe Golf Course. \"I said that after the Super Bowl [in 2023] when I played my brother, meeting my brother at the mountain top was the peak of my life. You know, it's just kind of been, keep going up and up from there.\" \"Who knows man,\" he added, pondering another Super Bowl victory. \"Who knows where this thing goes, if I get a chance to win another one.\" When asked if there's any chance he'll tap back into his backup-dancer skills — a reference to his June 23 cameo during the Eras Tour at London’s Wembley Stadium — Kelce didn't reveal too much. \"I can't let anything out of the bag,\" he said, laughing, \"but right now I'm in full football mode after golf.\" Elsewhere during the discussion, Kelce was nudged about a potential third consecutive Super Bowl victory. The athlete, who has helped his Chiefs clench the title in 2020, 2023 and 2024, revealed that while it would be a \"long haul\" to do so again, he's \"ready to get back to work.\" \"Oh, you know it's possible,\" he said. \"Anything is possible, you knew that.\" While Kelce didn't give anything away about a return to the Eras Tour stage, he did give fans a show to remember when he stepped onstage with Swift during one of her London shows last month. The surprise appearance came during Swift's \"I Can Do It With a Broken Heart\" outfit change, when Kelce picked Swift off the stage floor and carried the superstar to a couch area for her outfit change. Rocking a tuxedo and top hat, Kelce also showed off a few dance moves. A day after the performance, Swift mentioned the cameo on Instagram. “I’m still cracking up/swooning over @killatrav’s Eras Tour debut ? ,” Swift wrote in the caption of an Instagram post about the London shows. The PEOPLE Puzzler crossword is here! How quickly can you solve it? Play now! Kelce's brief appearance at the Eras Tour wasn't his only performance in recent weeks. During the charity golf tournament on Thursday, July 11, Kelce took the stage for a karaoke contest, in which he sang Whitesnake's 1982 hit \"Here I Go Again.\" After reigning victorious in the contest, Kelce excitedly jumped up and down and shouted out his significant other. “Taylor, this is for you,” Kelce said in a video shared on X (formerly Twitter). Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer​​, from celebrity news to compelling human interest stories. The NFL season kicks off again for Kelce and his Chiefs on Sept. 5 when the reigning Super Bowl champions face the Baltimore Ravens.",
        "publish_date": "2024-07-13 16:49:26",
        "authors": [
            "Brenton Blanchet"
        ]
    },
    {
        "summary": "San Francisco 49ers legend Jerry Rice got into a spat with a Kansas City Chiefs writer after being asked about the Chiefs&apos; wide receivers.",
        "image": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2022/12/931/523/Jerry-Rice.jpg?ve=1&tl=1",
        "sentiment": 0.211,
        "author": "Ryan Morik",
        "language": "en",
        "video": null,
        "title": "Jerry Rice snaps at Chiefs reporter who asked question about team: 'I will f--k you up'",
        "url": "https://www.foxnews.com/sports/jerry-rice-snaps-chiefs-reporter-who-asked-question-about-team-i-f-k-you-up",
        "source_country": "us",
        "id": 251574638,
        "text": "The celebrity golf tournament in Lake Tahoe had a sour turn earlier this week, after Jerry Rice got into a verbal spat with members of the media. Rice was playing at the American Century Championships when he was approached by a Chiefs reporter for Starcade Media in Kansas City. The reporter recorded himself asking Rice whether the Chiefs had \"a good enough receiving corps this year to win again.\" CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM Rice initially ignored the question, but Starcade's video cuts a few moments later to Rice approaching the reporter, calling him a \"f---ing a--hole.\" Another video, obtained by TMZ, sees the two going back and forth, where Rice can be heard saying, \"I will f--k you up.\" Rice told TMZ that the question had been asked to get a rise out of the NFL legend. The Chiefs just beat his former San Francisco 49ers in the Super Bowl for the second time in four years this past February. \"I'm going to defend the San Francisco 49ers,\" he told TMZ, adding that the question had been asked with a smirk on the reporter's face. \"This is my history.\" PATRICK MAHOMES SR. CITED FOR DRIVING WITH INVALID LICENSE: REPORT The outlet, though, denied such a notion in a Facebook post where they wanted to \"set the record straight.\" \"We meant absolutely no disrespect to Jerry or the 49ers when asking this question as we have a profound respect for the great players that have played this game, especially (in our opinion) the greatest receiver of all time,\" the outlet said. \"The confrontation that followed was very unfortunate but we were not trying to elicit a negative reaction and there were no ‘smirks’ as Mr. Rice suggested. We simply wanted the input of the greatest receiver in league's history about the Chiefs receiving corps and if it had improved enough to continue winning at a high level after an historically rough season for the group. CLICK HERE TO GET THE FOX NEWS APP \"We would be more than open to speaking with Jerry personally to clear the air on what happened and put it all behind us.\" Follow Fox News Digital’s sports coverage on X, and subscribe to the Fox News Sports Huddle newsletter.",
        "publish_date": "2024-07-13 16:54:04",
        "authors": [
            "Ryan Morik"
        ]
    },
    {
        "summary": "Less than three months after Khyree Jackson was drafted into the NFL, he passed away after a car crash. During a vigil that was held in remembrance of him, tragedy struck again.",
        "image": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/07/931/523/GettyImages-2151833560-scaled.jpg?ve=1&tl=1",
        "sentiment": -0.268,
        "author": "Chantz Martin",
        "language": "en",
        "video": null,
        "title": "Shooting at candlelight vigil for late Vikings rookie Khyree Jackson leaves one dead, another injured",
        "url": "https://www.foxnews.com/sports/shooting-candlelight-vigil-late-vikings-rookie-khyree-jackson-leaves-one-dead-another-injured",
        "source_country": "us",
        "id": 251574632,
        "text": "A candlelight vigil for former Minnesota Vikings defensive back Khyree Jackson ended in more tragedy. Friday's vigil was held in Jackson's home state of Maryland as friends, family and members of the community gathered to remember the 24-year-old and two others who died in a car crash on July 6. The shooting happened around 10:00 p.m. at Jackson's former high school in Upper Marlboro, according to Prince Georges County Police Department. CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM FOX 5 DC reported that the shooting started in the parking lot near the front of the school. One person was reportedly hit in the leg, while the other individual was possibly struck in the chest. Police found a man and a woman suffering from apparent gunshot wounds when they arrived at the high school. Both were transported to a nearby hospital. SHOCKING PHOTOS SHOW TOTALED VEHICLE VIKINGS ROOKIE KHYREE JACKSON WAS IN DURING FATAL CRASH The woman was listed in stable condition. Authorities later confirmed that the male victim was pronounced dead. The Vikings selected Jackson in the fourth round of the NFL Draft less than three months ago. The team extended condolences to Jackson's loved ones shortly after learning of the fatal vehicle crash. \"Our thoughts are with Khyree's family, friends, teammates and coaches, as well as all the victims of this tragic accident,\" the NFL franchise's verified account shared to X, the company formerly known as Twitter. Vikings head coach Kevin O'Connell added that the news of Jackson's death left him \"heartbroken.\" Jackson and his former Wise High School football teammates, Isaiah Hazel and Anthony Lytton Jr. died in a car accident. Hazel was 23, while Lytton was 24. Hazel was driving a Dodge Charger at the time of the crash and was pronounced dead at the scene. Police also found Jackson dead at the crash site. Lytton was taken to the hospital, where he was later pronounced dead. CLICK HERE TO GET THE FOX NEWS APP Jackson, Hazel, and Lytton were all members of Wise's state high school championship team in 2016. Police have yet to arrest any suspects. Follow Fox News Digital’s sports coverage on X, and subscribe to the Fox News Sports Huddle newsletter.",
        "publish_date": "2024-07-13 17:01:25",
        "authors": [
            "Chantz Martin"
        ]
    },
    {
        "summary": "The &#39;Real Housewives of Orange County&#39; star has previously claimed the two were &#34;just friends&#34; when the accident occurred",
        "image": "https://people.com/thmb/wl2RWp3g5CCc9dbnai485sf4XNo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/shannon-storms-beador-john-janssen-bravocon-011123-1-625dd71c3c4940f9a6c380ac81fad2fd.jpg",
        "sentiment": -0.215,
        "author": "Jordan Greene",
        "language": "en",
        "video": null,
        "title": "Shannon Beador Admits She Was Dating John Janssen Again Before Her DUI: &#39;It Wasn’t a Good Time&#39; (Exclusive)",
        "url": "https://people.com/shannon-beador-dated-john-janssen-again-before-her-dui-exclusive-8677181",
        "source_country": "US",
        "id": 251573242,
        "text": "Shannon Storms Beador is getting candid about her romantic relationship with ex John Janssen. In an exclusive interview with PEOPLE, the Real Housewives of Orange County star opened up about their dating past, revealing that she and Janssen had actually gotten back together before her September 2023 arrest for an alleged DUI and hit-and-run. The pair previously dated for 3½ years starting in summer 2019. But in late 2022, Janssen called off their relationship, leaving Storms Beador \"blindsided\" and the two not on speaking terms. A friendship developed again months later and by March 2023, Storms Beador, 60, and Janssen, 61, found themselves in a familiar place. \"For about six months, he dated someone else and I dated someone else but after that, we reconnected,\" Storms Beador recalls. They kept their pairing secret, however, even as their relationship turned sexual. \"Both of us told everyone, 'No, we're not back together,' but we were acting like we were back together,\" she says. \"I think deep down, he and I both knew that it was never going to work,\" the mother of three adds. \"So, I wouldn't say we were back together publicly, but we were together privately, for about six months.\" PEOPLE reached out to Janssen's rep for comment. Reflecting on their rekindled relationship, the reality star says she felt uncertain about Janssen's intentions when they resumed dating. \"I'm not sure what he was really in it for,\" Storms Beador says. \"But at the same time, he moved very quickly with me and told me that he loved me right away, that we were going to spend the rest of our lives together.\" Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer, from juicy celebrity news to compelling human interest stories. Janssen was by Storms Beador's side throughout the summer, as she and her RHOC costars Tamra Judge and Vicki Gunvalson launched their now-defunct Tres Amigas Tour. But their romance didn't last into the fall. In the early hours of Sept. 17, Storms Beador was arrested in Newport Beach after crashing her car into a planter box attached to a house. She had been coming from Janssen's residence, where the two had been arguing. Police recorded Storms Beador with a .24 blood alcohol level (three times the legal limit). She was booked on two misdemeanors, and spent a few hours in jail before she was released on a citation. She'd later be sentenced to three years of probation, which came with a required order to complete 40 hours of community service and a nine-month alcohol program. Though Janssen supported Storms Beador in the wake of her arrest, roughly a week later, she says, he called her and ended their romance — claiming that the spotlight she brought with her had negatively impacted him and his family. \"It wasn't a good time,\" the Real for Real founder recalls, looking back on their second go-around. Of course, Bravo viewers know Janssen has moved on. He's currently dating Beador's RHOC costar Alexis Bellino, a romance that PEOPLE exclusively reported back in December. As for Beador, she's not dating anyone and tells PEOPLE she's not ready to get back on the horse just yet. \"I haven't given up on love at all,\" she says. \"I believe in, I still have the dream to be in a partnership with somebody. I don't know that I've ever really had that. So we'll see.\" The Real Housewives of Orange County airs Thursdays at 9 p.m. ET on Bravo.",
        "publish_date": "2024-07-13 17:11:53",
        "authors": [
            "Jordan Greene"
        ]
    },
    {
        "summary": "Dean Paul Martin, an actor and oldest son of Dean Martin, died in 1987. He was 35. The elder Martin&apos;s pals would later say that the Rat Pack member never recovered from the tragedy.",
        "image": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/07/931/523/Getty_DeanMartin_Music.jpg?ve=1&tl=1",
        "sentiment": 0.019,
        "author": "Stephanie Nolasco",
        "language": "en",
        "video": null,
        "title": "Dean Martin 'never recovered' from son's death in military training flight",
        "url": "https://www.foxnews.com/entertainment/dean-martin-never-recovered-sons-death-military-training-flight",
        "source_country": "us",
        "id": 251574636,
        "text": "Dean Martin, the \"King of Cool,\" never recovered after he lost his \"golden boy.\" The ‘50s crooner and member of the Rat Pack was struck by tragedy in 1985 following a lustrous Hollywood career. A military jet carrying his oldest son, Dean Paul Martin, crashed into the side of a mountain during a routine exercise in 1987. Martin's son was 35 at the time of his death. \"Dean Martin’s final years were very, very sad after he lost his son,\" author William Keck told Fox News Digital. \"It was like looking at a candle without a flame.\" DEAN MARTIN DIDN’T ATTEND JFK’S INAUGURATION FOR THIS REASON, DOC REVEALS: ‘IT WAS PRETTY REMARKABLE’ Keck, a former reporter for the National Enquirer, has written a new memoir about his decades-long career, \"When You Step Upon a Star: Cringeworthy Confessions of a Tabloid Bad Boy.\" In it, he details the celebrities he befriended, protected and wronged. Keck, who reported on Martin’s final years, said the singer was someone he was eager to protect. \"He was still the nice man that he seemed to be on television,\" said Keck. \"He would always greet me when I came over to his table. He would always say, ‘I’ll be back on that stage one day. You’ll see me.’ But he was done.\" \"He would eat by himself, always wearing the same outfit,\" Keck recalled \"It was navy pants and a light blue shirt. He would order the same dish — clams casino. He would just let the clam juice drip down his shirt. At a nearby table would be his ex-wife Jeanne… It was very strange to observe. It was like seeing a wax figure that was barely moving around.\" In his book, Keck described how Martin was suffering from \"a broken heart\" after losing his son. He claimed that every evening, Martin would go to the same Italian restaurant in Beverly Hills, La Famiglia, where the same dish awaited him. He was always spotted quietly twirling his pasta as he sat alone. Martin would always smile at Keck whenever he spotted the young writer. Martin even allowed Keck to take photos of him for his stories. CLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTER \"The problem was that it always looked like the same photo because he would wear the same outfit every time,\" Keck explained. \"You weren’t sure if it was taken six months ago or a year ago.\" Keck said he spoke to numerous pals to gain insight into what Martin’s life was like outside the spotlight. It was clear the patriarch was hurting. Dean Paul, nicknamed \"Dino Jr.,\" was a jack of all trades. According to People magazine, he made his mark with tennis and had a rock band with pals Desi Arnaz Jr. and Billy Hinsche. He eventually followed in his father’s footsteps and pursued acting. That led to a Golden Globe nomination for his role in the 1979 film \"Players.\" According to the outlet, Dean Paul was also a semi-professional football player, race car driver and pre-med student. But it appeared he finally found his calling when he became a pilot with the Air National Guard in 1981. \"I’m proud of him,\" Martin was quoted as saying by the outlet. \"I’d be proud even if he didn’t become a jet pilot because he’s a good boy. He just doesn’t know what he wants to be.\" According to The New York Times, Dean Paul and Capt. Ramon Ortiz, 39, were in one of three F4-C Phantom jets that were flying maneuvers near the San Bernadino Mountain range. The plane was lost and the remains of both men were found six days later. LIKE WHAT YOU’RE READING? CLICK HERE FOR MORE ENTERTAINMENT NEWS ''Capt. Dean Paul Martin and Capt. Ramon Ortiz perished instantly at the time of impact,'' Sgt. Carolyn Hamilton, an Air National Guard spokeswoman, said at the time. According to officials, the jet piloted by Dean Paul plunged nearly 4,000 feet from its last radar altitude reading of 9,300 feet. The outlet noted that it hit the side of the mountain at about 400 miles an hour. \"[Dean Paul's] death had a huge impact on Dean Martin,\" said Keck. \"Everyone who knew Dean Martin would tell you that. And it was [his pal] Rich Little who told me that once he lost his son, that was the end of him. That was a big part of him that died and never recovered.\" The Associated Press quoted singer Paul Anka as saying that the death of Martin’s son was \"a huge turning point.\" \"After that event in his life, things really changed,\" said Anka. Martin passed away at his Beverly Hills home on Christmas Day 1995. He was 78. CLICK HERE TO GET THE FOX NEWS APP \"In a way, he fooled us,\" said Keck. \"He kept going. I remember we weren’t going to miss his funeral. It was a private VIP service with all of these celebrities. Everyone wanted to pay their respects. I remember at one point it just got dark. All you could hear was Rosemary Clooney, George Clooney’s aunt, singing ‘Everybody Loves Somebody.'\" \"It was completely surreal,\" Keck admitted. \"In the end, it was a friend paying tribute to him.\" Keck said his memories of greeting Martin at the same restaurant for his stories are bittersweet. \"I remember him always greeting me with that warm smile,\" said Keck. \"It was heartbreaking. I don’t think his broken heart ever healed.\"",
        "publish_date": "2024-07-13 17:14:32",
        "authors": [
            "Stephanie Nolasco"
        ]
    },
    {
        "summary": "The actor reacted to the dramatic dismissal with prejudice of his involuntary manslaughter charges in an Instagram post",
        "image": "https://people.com/thmb/eiZ6x4TwjXE7hKXuMBtcSaPpnfg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(745x307:747x309)/Alec-Baldwin-rust-040324-tout-48c43dffdfbb4455a36b51d922742725.jpg",
        "sentiment": -0.126,
        "author": "Jack Smart,Nicholas Rice",
        "language": "en",
        "video": null,
        "title": "Alec Baldwin Speaks Out Following Rust Shooting Case Dismissal: &#39;I Appreciate Your Kindness&#39;",
        "url": "https://people.com/alec-baldwin-speaks-out-following-rust-shooting-case-dismissal-8677594",
        "source_country": "US",
        "id": 251576066,
        "text": "Alec Baldwin is speaking out after the dramatic dismissal of his involuntary manslaughter trial tied to his Rust shooting case. Following Judge Mary Marlowe Sommer’s decision on Friday, July 12, to dismiss with prejudice the case on its third day in Santa Fe’s 1st Judicial District Court of New Mexico, the 66-year-old actor-producer expressed relief that the years-long legal drama was over in an Instagram post on July 13. \"There are too many people who have supported me to thank just now,\" Baldwin wrote alongside an image of himself in court. He added, \"To all of you, you will never know how much I appreciate your kindness toward my family.\" Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer, from juicy celebrity news to compelling human interest stories. Baldwin was indicted by a New Mexico grand jury in January after the gun he was holding during a 2021 rehearsal on the set of his Western movie discharged, killing cinematographer Halyna Hutchins and injuring director Joel Souza. Baldwin has since maintained that he did not pull the trigger of the gun or know why it contained live ammunition. He pleaded not guilty and, had he been convicted, faced up to 18 months in prison. The actor’s legal team had repeatedly asked for the case to be dropped, including on July 12, when special prosecutor Kari Morrissey made the unusual move of taking the stand herself to testify about possibly suppressing relevant evidence. In part because ammunition that was dropped off at the Santa Fe Sheriff’s Office was filed separately, “the late discovery of this evidence during trial has impeded the effective use of evidence in such a way that it has impacted the fundamental fairness of the proceedings,” said Sommer in the announcement of her decision, which prompted Baldwin to burst into tears. Alongside his wife Hilaria Baldwin, others who supported the star throughout the three-day trial were his sister Beth Keuchler and brother Stephen Baldwin. The latter, not long before the dismissal, approached attorney Alex Spiro in the hallway outside of the courtroom and told him, \"You have made us so happy. We are planning to celebrate.\" On the horizon for Baldwin and his wife is a TLC reality series called The Baldwins, announced in June, about their sprawling family. The couple share seven children: Ilaria Catalina Irena, 19 months, María Lucía Victoria, 3, Eduardo \"Edu\" Pao Lucas, 3, Romeo Alejandro David, 5, Leonardo Ángel Charles, 7, Rafael Thomas, 8, and Carmen Gabriela, 10. Baldwin also shares Ireland, 28, with ex-wife Kim Basinger. Rust resumed filming and completed its shoot in May of 2023. In an Instagram post celebrating its completion, Baldwin wrote, “It’s been a long and difficult road. But we reach the end of the trail today.”",
        "publish_date": "2024-07-13 17:19:12",
        "authors": [
            "Jack Smart",
            "Nicholas Rice"
        ]
    },
    {
        "summary": null,
        "image": "https://media.zenfs.com/en/cnn_articles_875/81a9bd4b89e8c58660fc609dde50c0fb",
        "sentiment": 0.157,
        "author": "Catherine Nicholls And Sana Noor Haq, Cnn",
        "language": "en",
        "video": null,
        "title": "Tributes flood in for BBC sport commentator’s wife and daughters who were killed in suspected crossbow attack",
        "url": "https://www.yahoo.com/news/tributes-flood-bbc-sport-commentator-115348684.html",
        "source_country": "us",
        "id": 251577952,
        "text": "Figures from across the United Kingdom have offered their condolences to a BBC sport commentator, after his wife and two daughters were killed by an alleged crossbow attacker, in deaths that again drew attention to the epidemic of violence against women. Carol Hunt, 61, wife of BBC horse racing commentator, John Hunt, and their daughters, Hannah Hunt, 28, and Louise Hunt, 25, died from injuries sustained in an attack in Bushey, just northwest of London, on Tuesday, according to police and Britain’s public broadcaster. A 26-year-old suspect wanted in connection with the killings, and named as Kyle Clifford, was found by British police in Enfield, north London, on Wednesday, following a sprawling manhunt. There were no previous reports to the force over Clifford, who is in serious condition in hospital and is yet to speak with officers, Hertfordshire Police said in a statement. A crossbow was recovered as part of the investigation, which police believe was used in a “targeted incident.” Epidemic of violence against women The killings of the three women rocked Britain, where mass murders are infrequent but violence against women and girls has been officially labeled as a national threat. A woman is killed by a man every three days in the UK and one in four women will experience domestic violence in her lifetime, the United Nations’ special rapporteur on violence against women and girls, Reem Alsalem, said earlier this year. Charities and human rights organizations have subsequently reiterated urgent demands to tackle femicide in the UK. “Male violence against women and girls is at epidemic levels,” said SafeLives, a UK-based charity working to end domestic abuse, adding: “Domestic abuse is a major public health crisis. It should be given the same priority as terrorism.” Refuge, a UK-based non-profit providing support for survivors of domestic abuse, posted on X: “Our thoughts are with Carol, Hannah and Louise Hunt and their family and friends following the devastating incident in Bushey.” British Home Secretary Yvette Cooper called the attack “truly shocking,” adding that she is “being kept fully updated” by authorities. The country’s new Labour government campaigned on a manifesto to “tackle the scourge of violence against women and girls” in Britain, including a review of the sentencing process, and requiring forces to target repeat offenders with tools used for counter-terror and serious organized crime investigations. ‘His life was ripped apart’ An array of BBC journalists paid tributes to their colleague, in an outpouring of grief across the organization and wider sports industry. BBC Sport presenter Mark Chapman said: “John Hunt is our colleague, and our friend, not just to the current 5 Live Sport team, but to all of those who have worked here with him over the past 20 years. “On behalf of everybody connected to 5 Live Sport, our love and thoughts and support are with John and his family,” Chapman said live on air. Dan Walker, who used to host the BBC show Football Focus, posted on X that: “John Hunt is one of the best and his life was ripped apart yesterday.” Tim Peach, a producer for BBC Cricket, described Hunt as “one of the kindest, most thoughtful people I’ve ever worked with.” “He’s peerless at his job,” Peach said on X, “but he’s always happiest talking about ‘my Carol’ and ‘my girls.’” Michael Owen, a former soccer player and racehorse owner, also posted on X following England’s soccer win at the European Championship, writing that “while the country celebrate(s), spare a thought for John Hunt. I can’t remember feeling so utterly horrified in years. Those poor girls. Truly horrific.” The British Horseracing Authority (BHA) said in a statement that its thoughts are with Hunt, his family, and friends. “It is impossible to comprehend the horror that has been inflicted upon them by this dreadful event,” Julie Harrington, the BHA chief executive, said. Ascot Racecourse, one of Britain’s most famous horse-racing grounds, said that it echoed the BHA’s words and posted that “our thoughts are with John Hunt at this tragic time.” Crossbow legislation in the UK The strength of crossbow laws in the UK was called into question last year, after a British man was incarcerated for breaking into Windsor Castle and planning to assassinate the late Queen Elizabeth II with the weapon in 2021. At the time, the former Conservative government did not change the legislation, despite launching an eight-week review of the rules and the possibility of introducing a licensing scheme. In Britain, it is legal for a person to buy or own a crossbow if they are over 18, though anyone who carries one in public without a reasonable excuse can face imprisonment. Crossbow attacks in the UK are rare, with fewer than 10 homicides by crossbow between 2011 and 2021, according to the government. The British home secretary is now re-examining the country’s crossbow laws, according to her colleague, security minister Dan Jarvis. “We are seized by the seriousness and the importance of this,” Jarvis told the BBC’s Today program on Thursday, adding that the new government has “made a manifesto commitment” to halve violence against women and girls in Britain over a 10-year period. “We will move as quickly as we possibly can to reach a judgement about whether we do need to amend the existing legislative framework,” he added. This story has been updated with additional information. CNN’s Sugam Pokharel, Benjamin Brown, Louis Mian, Eve Brennan contributed reporting. For more CNN news and newsletters create an account at CNN.com",
        "publish_date": "2024-07-13 17:22:40",
        "authors": [
            "Catherine Nicholls And Sana Noor Haq, Cnn"
        ]
    }
]
